class Article {
  String? image;
  String title;
  String text;
  String? starnote;
  String? image2;
  String? text2;
  String? starnote2;
  Article(
      {this.image,
      required this.title,
      required this.text,
      this.starnote,
      this.text2,
      this.image2,
      this.starnote2});
}

List<Article> articleData = [
  Article(
      title: '',
      text:
          'از زمانی که ارزش جهانی صنعت بازی تا 300 بیلیون دلار رشد کرد، دیگر بازی کردن فقط یک تفریح برای اوقات فراغت محسوب نمی شود. این روز های افراد زیادی درآمد های کلانی از بازی کردن بدست می آورند، کاری که زمانی تفریح محسوب می شد امروزه می تواند منبع درآمد خوبی برای افراد باشد، مخصوصا از زمانی که بازی ها بر پایه بلاکچین و ارز های دیجیتال ساخته شده اند این فرصت برای افراد بیشتری بوجود آمد تا بتوانند همراه با تجربه بازی درآمد هم کسب کنند.',
      image: 'assets/images/top-p2e-games-march.jpg',
      starnote:
          'کاری که زمانی تفریح محسوب می شد امروزه می تواند منبع درآمد خوبی برای افراد باشد',
      text2:
          'برای افراد شاغل این بازی ها میتونه به عنوان درآمد جانبی به افزایش درآمدشون کمک کنه و برای افرادی که درآمد ندارند می تونه خرج زندگی روزانشون رو تامین کنه و برای این کار فقط به اینترنت و چند ساعت زمان در روز نیاز دارید ولی باید بدونید که بیشتر برای کسب درآمد وجود دارد در واقع را های نا محدودی وجود دارد تا شما بتوانید از بازی های بلاکچینی کسب درآمد کنید تو این بخش هفت راهی که می تونید ازش درآمد بیشتری کسب کنید را توضیح می دهیم ',
      image2: 'assets/images/fdfdfd.jpg',
      starnote2:
          'برای افراد شاغل این بازی ها میتونه به عنوان درآمد جانبی به افزایش درآمدشون کمک کنه '),
  Article(
      title: 'یک : فقط بازی کن ',
      text:
          'این خیلی سادست، بازی مورد علاقه ات را انتخاب کن، شروع به بازی کن، از بازی کردن لذت ببر و در همین حال از پاداش ها و توکن هایی رو که بازی به شما هدیه میده کسب درآمد کنید، در این روش شما به این کار به عنوان شغل نگاه نمی کنید و همین باعث میشه که تحت استرس و اضطراب نباشید پس همینطور که از اوقات فراغت خودتون لدت می برید پول هم بدست می آورید. خب می پرسی با چی شروع کنم ؟ با یه بازی معروف مثل Axie infinity ( در قسمت معرفی بازی ها این بازی رو معرفی کردیم)',
      starnote:
          'در منو قبلی لیستی از بازی های معروف بلاکجین برای شما فراهم شده است',
      image: 'assets/images/blockchain-game.jpeg'),
  Article(
    title: 'دو: در تورنومنت ها شرکت کن',
    text:
        'وقتی خوب بازی را یاد گرفتید و یه شخصیت با توانایی های خوب ساختید میتونید وارد رقابت ها بشید و در تورنومنت ها شرکت کنید تا پاداش های بیشتری کسب کنید، خیلی از تورنومنت های غیر رسمی هستند و خیلی های دیگه تورنومنت های بین المللی. علاوه بر این ها به صورت روتین تورنومنت هایی هم هستند که بعد از رسیدن به سطح خاصی به اونا دست رسی پیدا می کنید و می تونید پول بیشتری در بیارید.',
    image: 'assets/images/Gamer-620x400.jpg',
  ),
  Article(
      title: 'سه: کارکترت رو ارتقا بده یا یکی بهترشو قرض کن ',
      text:
          'هرچقدر بیشتر بازی کنید ، کارکتر شما بیشتر پیشرفت می کند ( در بیشتر بازی ها این کارکتر ها به شکل NFT هستند) و می توانید درآمد بیشتری داشته باشید به طور مثال یک شخصیت سطح بالا می تواند در رقابت سخت تری شرکت کند که جوایز بهتری دارد، این کار کمی زمان براست و نیاز به حوصله دارد ولی راه کوتاه تری هم وجود دارد، شما می توانید NFT بازیکنان سطح بالاتر را قرض بگیرید و با آن در رقابت های سطح بالا شرکنت کنید ولی در عوض درصدی از جایزه ای را  که می برید روباید به صاحب NFT بدهید به این فرآیند Scholarship می گویند.',
      image: 'assets/images/dyfgh.jpg'),
  Article(
      title: 'چهار: قرض دادن توکن',
      text:
          'اگه به اندازه کافی روی کارکترتون وقت گذاشتید و اون رو به سطح خوبی رسونده باشید با قرض دادن NFT خودتون میتونید یک درآمد ثابت بدست بیاورید، این یکی از بهترین روش ها برای کسب درآمد از آیتم هایی است که وقت زیادی براشون گذاشتید ولی دیگه ازشون استفاده ای نمی کنید. بستر های مناسبی مثل سایت LaborX هستند که این کار رو انجام میدهند و نیاز نیست که شما مالکیت NFT خودتون رو به شخص دیگه ای بدهید.',
      image: 'assets/images/loan1.jpg',
      image2: 'assets/images/loan22 copy.png'),
  Article(
      title: 'پنج: فروش توکن ',
      text:
          'راه دیگه کسب درآمد فروش آیتم هایی هستش که دیگه بهشون نیاز ندارید، اگه یک کارکترارزشمند و یا تجهیزات مورد قبولی در اختیار دارید می تونید اون رو در مارکت های مخصوص خود بازی به فروش بزارید و بفروشید',
      image: 'assets/images/sell.jpeg'),
  Article(
      title: 'شش: برنامه لایو بزارید ',
      text:
          'اگه با پلتفرم هایی مثل تویچ آشنایی دارید میدونید فرصتی هست که با نمایش بازی خودتون درآمد کسب کنید، درسته که پیدا کردن مخاطب کار سختیه ولی ترکیب بازی های بلاکچین همراه با لایو استریم درآمد خیلی بالایی براتون به ارمغان می آورد.',
      image:
          'assets/images/617bf5df33032d826fffe40d_Снимок экрана 2021-10-29 в 16.23.16.png'),
  Article(
      title: 'هفت: عضو انجمن شوید ',
      text:
          'ابتکاراتی مثل Crypto Gaming United این امکان را به بازیکنان میده که اطلاعاتشون رو با هم به اشتراک بزارن، یاد بگیرند، بهترین بازی ها رو پیدا کنن و در مقابل کمک کردن به دیگران درآمد کسب کنن، میشه گفت این یه معامله برد برد است چون هدف این جامعه بالا بردن کسب درآمد اعضای خودش است و با این کار درآمد خود انجمن نیز بالا می رود.',
      image: 'assets/images/1_sgTn_PEbwzHM8J11qMlkKw.jpeg',
      starnote:
          'باید بدونید که همه چی به این هفت روش ختم نمی شود و بازی های بلاکچینی هر روز در حال پیشرفت هستند و روش های جدیدی برای کسب درآمد ارائه می کنند',
      text2:
          'شما باید همواره با مطالعه سایت ها و انجمن ها اطلاعت خودتون رو بروز کنید. در بخش های بعدی چند بازی معروف بلاکچینی بررسی می کنیم.')
];
