class Article {
  String? image;
  String title;
  String text;
  String? starnote;
  String? image2;
  String? text2;
  String? starnote2;
  Article(
      {this.image,
      required this.title,
      required this.text,
      this.starnote,
      this.text2,
      this.image2,
      this.starnote2});
}

List<Article> articleData = [
  Article(
      title: '',
      text:
          'از زمانی که ارزش جهانی صنعت بازی تا 300 بیلیون دلار رشد کرد، دیگر بازی کردن فقط یک تفریح برای اوقات فراغت محسوب نمی شود. این روز های افراد زیادی درآمد های کلانی از بازی کردن بدست می آورند، کاری که زمانی تفریح محسوب می شد امروزه می تواند منبع درآمد خوبی برای افراد باشد، مخصوصا از زمانی که بازی ها بر پایه بلاکچین و ارز های دیجیتال ساخته شده اند این فرصت برای افراد بیشتری بوجود آمد تا بتوانند همراه با تجربه بازی درآمد هم کسب کنند.',
      image: 'assets/images/top-p2e-games-march.jpg',
      starnote:
          'کاری که زمانی تفریح محسوب می شد امروزه می تواند منبع درآمد خوبی برای افراد باشد',
      text2:
          'برای افراد شاغل این بازی ها میتونه به عنوان درآمد جانبی به افزایش درآمدشون کمک کنه و برای افرادی که درآمد ندارند می تونه خرج زندگی روزانشون رو تامین کنه و برای این کار فقط به اینترنت و چند ساعت زمان در روز نیاز دارید ولی باید بدونید که بیشتر برای کسب درآمد وجود دارد در واقع را های نا محدودی وجود دارد تا شما بتوانید از بازی های بلاکچینی کسب درآمد کنید تو این بخش هفت راهی که می تونید ازش درآمد بیشتری کسب کنید را توضیح می دهیم ',
      image2: 'assets/images/fdfdfd.jpg',
      starnote2:
          'برای افراد شاغل این بازی ها میتونه به عنوان درآمد جانبی به افزایش درآمدشون کمک کنه '),
  Article(
      title: 'یک : فقط بازی کن ',
      text:
          'این خیلی سادست، بازی مورد علاقه ات را انتخاب کن، شروع به بازی کن، از بازی کردن لذت ببر و در همین حال از پاداش ها و توکن هایی رو که بازی به شما هدیه میده کسب درآمد کنید، در این روش شما به این کار به عنوان شغل نگاه نمی کنید و همین باعث میشه که تحت استرس و اضطراب نباشید پس همینطور که از اوقات فراغت خودتون لدت می برید پول هم بدست می آورید. خب می پرسی با چی شروع کنم ؟ با یه بازی معروف مثل Axie infinity ( در قسمت معرفی بازی ها این بازی رو معرفی کردیم)',
      starnote:
          'در منو قبلی لیستی از بازی های معروف بلاکجین برای شما فراهم شده است',
      image: 'assets/images/blockchain-game.jpeg'),
  Article(
    title: 'دو: در تورنومنت ها شرکت کن',
    text:
        'وقتی خوب بازی را یاد گرفتید و یه شخصیت با توانایی های خوب ساختید میتونید وارد رقابت ها بشید و در تورنومنت ها شرکت کنید تا پاداش های بیشتری کسب کنید، خیلی از تورنومنت های غیر رسمی هستند و خیلی های دیگه تورنومنت های بین المللی. علاوه بر این ها به صورت روتین تورنومنت هایی هم هستند که بعد از رسیدن به سطح خاصی به اونا دست پیدا می کنید و می تونید پول بیشتری در بیارید.',
    image: 'assets/images/Gamer-620x400.jpg',
  ),
];
