class CarouselModel {
  int id;
  String name;
  String text;
  String image;
  CarouselModel({
    required this.id,
    required this.name,
    required this.text,
    required this.image,
  });
}

List<CarouselModel> carouselList = [
  CarouselModel(
      id: 1,
      name: 'The Merge',
      text:
          'The Merge ،  91.8 میلیون دلار،گران ترین NFT که تا کنون به فروش رفته ، جالبه بدونید که هویت واقعی طراح این NFT مشخص نیست و همه اورا با اسم مستعار Pak می شناسند، Pak یکی از هنرمندان معروف دنیای NFT است و آثار مفهومی مشهوری از او بفروش می رسد.',
      image: 'images/famous-TheMerge.jpg'),
  CarouselModel(
      id: 2,
      name: 'اولین 5000 روز',
      text:
          'این اثر از یک هنرمند دیجیتال به نام Beeple به قیمت 69.3 میلیون دلار در یک حراج فروش رفت ،در سال 2021 گران ترین NFT تاریخ بود،Beeple به مدت 13 سال هر روز یک عکس در اینستاگرامش آپلود می کرد ، این NFT مجوع آن 5000  عکس او است.',
      image: 'images/famous-500days.jpg'),
  CarouselModel(
      id: 3,
      name: 'Clock ساعت',
      text:
          'جولین آسانژ خالق ویکیلیکس به کمک هنرمند مشهور ولی نا شناس به اسم پاک (PAK) این اثر را خلق کرد ، این تصویر ساعاتی که جولین آسانژ در زندان به سر برده را نمایش می دهد، شاید باورتان نشود که این تصویر 52.7 میلیون دلار به فروش رفت.',
      image: 'images/famous-Clock.jpg'),
  CarouselModel(
      id: 4,
      name: 'HUMAN ONE',
      text:
          'این NFT هم  از Beeple طراح اثر معروف 5000 روز است که به قیمت 28.9 میلیون دلار به فروش رفت ، یک تصویر سه بعدی از یک فضا نورد سرگردان که پیوسته در حال قدم زدن مبباشد ، Beeple می گوید این تصویر اولین پرتره یک انسان متولد شده در متاورس است.',
      image: 'images/famous-HumanOne.gif'),
  CarouselModel(
      id: 5,
      name: 'کالکشن کربپتو پانک',
      text:
          'کربپتو پانک جزء اولین کالکشن های معروف NFT است که آیتم های آن همیشه در لیست گرانترین NFT ها بوده اند، این کالکشن ده هزار عکس 24*24 پیکسل را شامل می شود.بر مرور زمان کریپتو پانک ها به عنوان یک نماد سرمایه گذاری شناخته شدند، کریپتو پانک #5822  CryptoPunk ، گران ترین عضو این خانواده  به قیمت 23.7 میلیون دلار به فروش رسید.',
      image: 'images/famous-CryptoPunk.jpg'),
  CarouselModel(
      id: 6,
      name: 'کالکشن Bored Ape Yacht Club (BAYC)',
      text:
          'میمون های بی حوصله مجموعه ای  از 10000 توکن است که در سال 2021 راه اندازی شد. این کاریکاتورها شامل حالات مختلف چهره، لباس ها و عناصر منحصر به فرد هستند. در ابتدا این میمون ها صد ها هزار دلار معامله می شدند ،ولی امروزه میلیون ها دلار ارزش دارند، صاحبان این میمون ها جزئی از کلوب BAYC هستند و از امتیازات انحصاری مانند فضاهای اختصاصی آنلاین، کالا های انحصاری رویداد های زنده مخصوص اعضا بهره مند می شوند.',
      image: 'images/famous-BAYC.jpg')
];
