class ChapterDetail {
  int id;
  String? image;

  String text;
  String? starnote;
  String? image2;
  String? text2;
  String? starnote2;
  String? titleSection;
  List<String>? tableList;
  List<String>? benefits;
  List<Map<String, String>>? resourceInfo;
  ChapterDetail({
    required this.id,
    this.image,
    required this.text,
    this.starnote,
    this.text2,
    this.image2,
    this.starnote2,
    this.titleSection,
    this.tableList,
    this.benefits,
    this.resourceInfo,
  });
}

class Nfts {
  int id;
  String title, chapter, image;
  List<ChapterDetail> chapterDetailList;

  Nfts({
    required this.id,
    required this.chapterDetailList,
    required this.chapter,
    required this.title,
    required this.image,
  });
}

List<Nfts> nftsData = [
  Nfts(
    id: 011,
    chapter: 'مقدمه',
    title: 'بلاکچین چیست',
    image: 'images/0-whatIsBlockchain.jpg',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'The Street Crypto: Bitcoin and cryptocurrency news',
              'site':
                  'https://www.thestreet.com/crypto/bitcoin/what-is-a-blockchain-the-simple-explanation'
            },
            {
              'name': 'What Is Blockchain and How Does It Work? | Synopsys',
              'site':
                  'https://www.synopsys.com/glossary/what-is-blockchain.html'
            }
          ],
          id: 01101,
          image: 'images/0-whatIsBlockchain.jpg',
          titleSection: 'بلاکچین چیست',
          text:
              'اگه بخوایم خیلی ساده بگیم بلاکچین یک پایگاه اطلاعاتی توزیع شده است که دیتا ها در آن به ترتیب وقوع زمان و تاریخ ثبت می شوند ، برخلاف دیتابیس های مرکزی شرکت ها ،همگان می توانند به اطلاعات بلاکچین دسترسی داشته باشند ، و برخلاف دیتابیس های دیگر نمی توان چیزی را در بلاک چین پاک کرد یا ویرایش کرد ، فقط می توان به بلاک چین اطلاعات اضافه کرد.',
          text2:
              'پایگاه اطلاعاتی توزیع شده یعنی چی ؟ یعنی تمام اطلاعات در یک سرور مرکزی در یکجا ذخیره نمی شود ،در بلاکچین بیشمار سرور و کامپیوتر در سرتاسر شبکه جهانی به هم متصل شده اند که به آنها نود (nod)گفته می شود،',
          starnote:
              ' از بلاکچین های معروف می توان به BNB Chain، سولانا، اتریوم، ریپل، بیت کوین و استلار اشاره کرد ، البته لیست بالا بلندی از بلاکچین ها وجود دارد که متناسب با ویژگی های منحصر بفردشان ، هرکدام طرفداران خودشان را دارند'),
    ],
  ),
  Nfts(
    id: 012,
    chapter: 'مقدمه',
    title: 'اتریوم چیست',
    image: 'images/0-Ethereum-1.jpg',
    chapterDetailList: [
      ChapterDetail(
        resourceInfo: [
          {
            'name': 'What Is Ethereum And How Does It Work? – Forbes Advisor',
            'site':
                'https://www.forbes.com/advisor/investing/cryptocurrency/what-is-ethereum-ether/',
          },
          {
            'name': 'What Is Ethereum? (investopedia.com)',
            'site': 'https://www.investopedia.com/terms/e/ethereum.asp',
          },
          {
            'name':
                'What Is Ethereum and What Are Its Use Cases? | OriginStamp',
            'site':
                'https://originstamp.com/blog/what-is-ethereum-and-what-are-its-use-cases/',
          },
          {
            'name':
                'What are DApps? Everything there is to know about decentralized applications (cointelegraph.com)',
            'site':
                'https://cointelegraph.com/defi-101/what-are-dapps-everything-there-is-to-know-about-decentralized-applications'
          },
        ],
        id: 01201,
        image: 'images/0-Ethereum-1.jpg',
        titleSection: 'اتریوم چیست',
        text:
            'اتریوم یک شبکه غیر متمرکز بر پایه تکنولوژی بلاکچین است و بیشتر بخاطر ارز دیجیتال بومی خود به نام اتر شناخته می شود. وجود  قرارداد های هوشمند اتریوم باعث شد که در NFT بسیار پر کاربرد شود، شرکت اتریوم زبان برنامه نویسی Solidity را توسعه داده است که در ساخت نرم افزار ها با قرارداد های هوشمند در بستر اتریوم استفاده می شود. ',
        starnote:
            'مقیاس پذیری ، برنامه پذیری ، امنیت و غیر متمرکز بودن اتریوم اون رو به انتخاب اول توسعه دهنده ها تبدیل کرده',
        starnote2:
            'اتریوم هم اکنون یک پله پایین تر از بیت کوین ، جایگاه دوم بازار جهانی رمز ارز ها را در اختیار دارد.',
      ),
    ],
  ),
  Nfts(
    id: 013,
    chapter: 'مقدمه',
    title: 'قرارداد هوشمند',
    image: 'images/0-smartContract.jpg',
    chapterDetailList: [
      ChapterDetail(
        resourceInfo: [
          {
            'name':
                'Blockchain Facts: What Is It, How It Works, and How It Can Be Used',
            'site': 'https://www.investopedia.com/terms/b/blockchain.asp',
          },
          {
            'name': 'What are smart contracts on blockchain?',
            'site': 'https://www.ibm.com/topics/smart-contracts'
          },
        ],
        id: 01301,
        image: 'images/0-smartContract.jpg',
        titleSection: 'قرارداد هوشمند',
        text:
            'قرارداد هوشمند یک کد است که می تواند در زنجیره بلوکی برای تسهیل، تأیید یا مذاکره برای یک توافق نامه ساخته شود. قراردادهای هوشمند تحت مجموعه شرایطی عمل می کنند که کاربران با آن موافقت می کنند. هنگامی که این شرایط برآورده شد، شرایط توافق به طور خودکار اجرا می شود.',
        text2:
            'این قرارداد ها  معمولاً برای خودکارسازی اجرای توافق استفاده می‌شوند تا همه شرکت‌کنندگان بتوانند فوراً بدون دخالت واسطه یا اتلاف زمانی از نتیجه مطمئن شوند. آنها همچنین می‌توانند گردش کار را خودکار کنند و در صورت برآورده شدن شرایط، اقدام بعدی را آغاز کنند.برای اینکه بتوانید قرار داد هوشمند بنویسید نیاز دارید تا زبان برنامه نویسی بلد باشید و کمی پول داشته باشید تا آن را قرارداد خودتون مستقر کنید.',
      ),
    ],
  ),
  Nfts(
    id: 014,
    chapter: 'مقدمه',
    title: 'کیف پول',
    image: 'images/0-wallet.jpg',
    chapterDetailList: [
      ChapterDetail(
        resourceInfo: [
          {
            'name': 'What Is a Blockchain Wallet? (investopedia.com)',
            'site':
                'https://www.investopedia.com/terms/b/blockchain-wallet.asp',
          },
          {
            'name': 'What Is a Blockchain Wallet? (fool.com)',
            'site':
                'https://www.fool.com/investing/stock-market/market-sectors/financials/blockchain-stocks/blockchain-wallet/',
          },
          {
            'name':
                'What Is A Blockchain Wallet & How Does It Work? (softwaretestinghelp.com)',
            'site':
                'https://www.softwaretestinghelp.com/what-is-a-blockchain-wallet/'
          },
        ],
        id: 01401,
        image: 'images/0-wallet.jpg',
        titleSection: 'کیف پول',
        text:
            'کیف پول دیجیتال یک برنامه بر پایه بلاکچین است که به شما  این امکان را میدهد تا ارز های دیجیتال و یا آیتم های بلاکچینی خودتون مثل NFT ذخیره کنید ، توسط کیف پول شما میتوانید دارایی های خود را مدیریت کنید ، کیف ها میتونن به صورت یک اپ داخل گوشی ، تحت وب ، برنامه دسکتاپ کامپیوتری و یا سخت افزاری باشن، کیف های سخت افزاری امن ترین گزینه هستند که توسط یک USB به کامپیوتر شما وصل می شود،',
        text2:
            ' بعد از ثبت نام یک شناسه یکتا کیف پول به شما تعلق می گیرد و با لاگین کردن در برنامه یا سایت می توانید به اطلاعات حساب خود دسترسی پیدا کنید، در کیف پولتان می تونید دارایی هاتون ، آخرین تراکنش ها و نمودار های قیمت ارزها را مشاهده کنید.کاربران می توانند با استفاده از کیف پول مانند کارت های بانکی  معامله انجام دهند با این تفاوت که بجای پول رمزارز مبادله می کنید.',
        starnote:
            ' بهتر است برای شروع سراغ کیف های سخت افزاری نروید و خیلی راحت به صورت آنلاین در یکی از ارائه دهندگان معتبر سرویس کیف پول دیجیتال ثبت نام کنید،',
        starnote2:
            ' در فصل های آینده چند کیف پول مناسب  برای NFT معرفی کرده ایم، البته کیف پول های متعدد و معروفی وجود دارد که شما می توانید با جستجو بیشتر در اینترنت با آنها آشنا شوید.',
      ),
    ],
  ),
  Nfts(
    id: 021,
    chapter: 'فصل اول',
    title: 'ان اف تی چیست',
    chapterDetailList: [
      ChapterDetail(
          id: 02101,
          titleSection: 'NFT چیست',
          text:
              'اگه تا حالا درباره NFT چیزی نشنیدید بهتره یک نگاهی به اتصال اینترنت بندازید چون ممکنه قطع شده باشه و از اخبار دنیا عقب مونده باشید، تو یک سال اخیر خبر های NFT تقریبا همه جا شنیده میشه. تیکتاک، توییتر، سی ان ان  و هر جایی که میریم یک خبر از معاملات عجیب و نجومی NFT هست، سوال اینجاست NFT چیه؟ بدرد من میخوره؟ منم میتونم باهاش پول در بیارم؟',
          image2: 'images/chapter2.png',
          text2:
              'NFT یک دارایی شخصی است که کاملا در دنیای دیجیتال وجود داره، نمیتونید لمسش کنید ولی میتونید مالکش باشید، NFT میتونه هر فایل دیجیتالی باشه مثلا یک کار هنری، مقاله، موزیک و حتی یک Meme که همین اواخر به قیمت 500 هزار دلار فروخته شد، سوالی که پیش میاد اینه که این توکن ها چطور می تونن به هنرمندان کمک کنن و باعث خلاقیت اونها بشن؟',
          starnote2:
              'NFT مخفف عبارت Non-Fungible Token به معنای "توکن غیرقابل معاوضه" می باشد.'),
      ChapterDetail(
        id: 02102,
        text:
            'در حالت کلی دارایی ها به دو دسته تقسیم میشن: دارایی های قابل معاوضه  و دارایی های غیرقابل معاوضه. برای درک دارایی های قابل معاوضه بهترین مثال همین پولی هستش که همه ما هر روز داریم ازش استفاده میکنیم. وقتی شما 10.000 تومن از پول خودتون رو با 10.000 تومن از پول دوست صمیمی تون مقایسه کنید متوجه میشید که از نظر شکل ظاهری و ارزش مادی هیچ فرقی باهم ندارن. پس اگر پول های خودتون رو باهم جابه جا کنید هیچ تغییری در ارزش دارایی خودتون ایجاد نکردید.',
        text2:
            'و اما دارایی های غیر قابل معاوضه؛ فرض کنید شما به یک خیاط سفارش دوخت یک دست لباس رو میدید که کاملا منحصر به فرد برای شما دوخته میشه. لباس شما یک دارایی غیر قابل معاوضه محسوب میشه چون هیچ لباسی شبیه اون وجود نداره.',
      ),
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'NFT art: what is it, how it works and what it means',
              'site': 'https://en.99designs.fr/blog/web-digital/nft-art/'
            },
            {
              'name': 'NFTs, explained',
              'site':
                  'https://crowdlustro.com/articles/nfts/9758303d-6162-4c16-9fe0-110c8ec46b75'
            }
          ],
          id: 02103,
          text:
              'قبل از اینکه سراغ هر چیز دیگه ای بریم اول میخوام شکل ساده شده ای از NFT رو توضیح بدم. فرض کنید شما یک نقاشی دیجیتالی رو با کلی زحمت خلق کردین. به این امید که با فروش این نقاشی پول خوبی رو به جیب بزنید. همون شب سیستم شما هک میشه و یک نسخه از نقاشی شما در سیستم آقای هکر کپی میشه! حالا چطوری میتونید ثابت کنید که خالق اون اثر شما هستید؟ اینجاست که NFT به داد ما میرسه! چطوری؟',
          text2:
              'اگر شما نقاشی دیجیتالی خودتون رو به NFT تبدیل کنید، حق مالکیت اون اثر تا زمانی که نقاشی رو نفروشید مال شماست و کسی نمیتونه ادعای مالکیت اثر رو داشته باشه.',
          starnote2:
              'NFT میتونه کاور یک فیلم، یک قطعه موسیقی، یک گیف، یک ویدیو کوتاه و ... باشد',
          image2: 'images/1-artist.jpg'),
    ],
    image: 'images/chapter1.png',
  ),
  Nfts(
    id: 022,
    chapter: 'فصل یک',
    title: 'مزایا',
    image: 'assets/images/article-ch4-1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 02201,
        titleSection: 'مزایا NFT',
        text:
            'به وجود اومدن NFT باعث انقلاب در حوزه کاری هنرمندان، کلکسیونر ها و شرکت های بازی سازی و ارز دیجیتال شده. یک هنرمند با خلق اثر های جدید که میتونه دیجیتالی باشه و هم به صورت فیزیکی روی بوم و... با تبدیل هنر خودش به NFT اون رو به همه و در بازار های بین المللی نشون بده و با حذف کلیه واسطه ها برای نمایش در گالری های مختلف میتونه سود بیشتری نسبت به فروش اون ها داشته باشه.',
        starnote:
            'همچنین حق مالکیت، این امکان رو فراهم میکنه که با هر خرید و فروش، قسمتی سود به خالق اثر هم  تعلق بگیره.',
        image2: 'images/1-mazaya.jpeg',
        text2:
            'یک کلکسیونر میتونه با خرید NFT و نگه داشتنش، منتظر بمونه تا ارزشش بیشتر بشه و با قیمت بالاتری بفروش برسونه و سود خوبی نسیبش بشه.',
      ),
      ChapterDetail(
        id: 02202,
        text:
            'حتما به این موضوع فکر کردید که چرا من باید پول به عکسی بدم که خیلی راحت میشه حتی با یک اسکرین شات ساده یک نسخه از اون رو داشته باشم؟ انقلاب NFT اینجاست که مشخص میشه... NFT در خودش اطلاعات هویتی صاحب اثر رو داره و هیچ کس قادر نیست با نسخه کپی از اون خودش رو صاحب اون اثر خطاب بکنه. همچنین NFT اطلاعات هویتی خالق خودش رو هم داره و خیلی راحت میشه متوجه شد که کدام نسخه اصلی است و کدام نسخه کپی برداری شده.',
        starnote:
            'به NFT علاوه بر یک کالای کلکسیونی میشه به دید یک کالای سرمایه ای هم نگاه کرد. این دیدگاه بستگی به نوع استفاده شما از این پدیده داره.',
        text2:
            'یکی دیگه از جذابیت های NFT امکان دسترسی برای ارتباط با خالق اون اثر و خریدار هستش که به شما این امکان رو میده علاوه بر خرید، به یک کانال ارتباطی متصل بشید و با هنرمند مورد علاقه تون در ارتباط باشید.',
        starnote2:
            'این رو در نظر داشته باشید که NFT شما ممکن به تعداد زیادی کپی بشه اما نکته مهم اینه که حق مالکیت اون هر جا که باشه به نام شما خواهد بود.',
      ),
      ChapterDetail(
        id: 02203,
        text: 'نکات مثبت NFT عبارت است از :',
        image: 'images/1-mazaya02.webp',
        benefits: [
          'حامل اطلاعات هویتی: هر توکن NFT یک مالک منحصر به فرد داره که هرکسی میتونه اون رو مشاهده و بررسی کنه.',
          'غیر قابل تقسیم: هیچ دو NFT مشابهی وجود ندارند چون اصلا قابل تقسیم نیستن و هر توکن NFT منحصر به فرد هستش. از طرفی شما نمیتونید یک NFT رو به قسمت های کوچکتر تقسیم کنید و از اون استفاده کنید. به طور مثال شما میتونید یک 1000 تومنی رو به پول های خورد تقسیم بندی کنید اما NFT رو نمیشه تقسیم کرد.',
          'تایید پذیر: از اونجایی که NFTها بر بستر بلاکچین هستند، خیلی راحت امکان چک کردن اصل بودن NFT برای شما فراهم شده است. بنابراین دغدغه خرید کالای غیر اصل برای شما وجود نداره.',
          'تخریب ناپذیر: فرض کنید سیل بیاد یا حتی آتش سوزی بزرگی در یکی از معروف ترین گالری های شهر رخ بده. چه بلایی سر NFT شما میاد؟ هیچی! NFT شما در بستر بلاکچین جاش کاملا امنه و خیالتون ازین بابت راحت باشه.',
          'دسترسی جهانی: هم خریداران NFT و هم خالق های اون ها به بازارهای جهانی دسترسی راحتی دارن و میتونن در سطح جهانی خرید و فروش خودشون رو انجام بدن.',
        ],
      ),
    ],
  ),
  Nfts(
    id: 023,
    chapter: 'فصل یک',
    title: 'کسب درآمد',
    image: 'assets/images/article-ch4-1.jpg',
    chapterDetailList: [
      ChapterDetail(
          id: 02301,
          titleSection: 'خلق آثار هنری',
          text:
              'این مورد مخصوص هنرمندهاست که میتونن یک اثر هنری مثل تابلو نقاشی، عکاسی، طرح گرافیکی و نواختن موسیقی رو خلق کنن. این افراد با پرداخت هزینه ای مشخص اثر خودشون رو به NFT تبدیل میکنن و شروع به قیمت گذاشتن روی مجموعه خودشون می کنن.',
          image: 'images/1-daramad01.jpg'),
      ChapterDetail(
          id: 02302,
          titleSection: 'حق امتیاز فروش',
          text:
              'تو این روش هنرمندهایی که اثر خودشون رو به شکل NFT فروختن میتونن حق امتیاز فروش روی اثر خودشون بذارن که با هربار خرید و فروش درصدی به کیف پولشون اضافه بشه. البته این روش میتونه باعث لطمه به مارکتینگ اون NFT بزنه.',
          image: 'images/1-daramad02.jpg'),
      ChapterDetail(
        titleSection: '',
        id: 02303,
        image2: 'images/1-daramad04.jpg',
        text:
            'واگذاری  NFT :  شما میتونین توکن خودتون رو به افراد دیگه قرض بدید تا بتونن باهاش وارد بازی بشن و از این طریق کسب درآمد داشته باشین.',
        text2:
            'بازی کردن : بازی های بسیار زیادی هستن که با انجام مراحل مختلف به عنوان جایزه به شما NFT میدن!',
      ),
      ChapterDetail(
          id: 02304,
          titleSection: 'خرید و فروش ',
          text:
              'مانند تمامی بارار های دیگر شما می توانید بعد از بررسی و تحلیل های مورد نیاز توکن هایی که پتانسیل رشد قیمت دارند رو بخرید و بعد به قیمت بالا تری  بفروشید',
          image: 'images/1-daramad03.jpg'),
    ],
  ),
  Nfts(
    id: 024,
    chapter: 'فصل یک',
    title: 'مدیریت مالی',
    image: 'assets/images/article-ch4-1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 02401,
        image: 'images/1-hoshdar01.jpg',
        text:
            'یادتونه چه بلایی سر بورس اومد؟ خیلی ها وام های کلان گرفتن، خونه و ماشین زیر پاشون رو فروختن و پولشون رو توی بورس سرمایه گذاری کردن. اما ااین دوستان این چند نکته رو اصلا نمیدونستن و کسی هم بهشون نگفته بود...',
        text2:
            'اولین اصل سرمایه گذاری اینه که شما باید با پول پس اندازی که دارید وارد سرمایه گذاری بشید و نباید با پولی که نبودنش توی زندگی آسیب به خودتون و خونوادتون میزنه دست به سرمایه گذاری بزنید. این رو همیشه یادتون باشه  سود زیاد همراه با ریسک خیلی زیاد هستش. پس اگر دنبال سود خیلی خوبی توی مدت زمان کمی هستین بدونید که ریسک اون سرمایه گذاری رو هم باید بپذیرید.',
      ),
      ChapterDetail(
        id: 02402,
        text:
            'هیچ تظمینی وجود نداره که سرمایه گذاری شما سود داشته باشه. حالا میخواد تو هر بازاری باشه و هر کاری باشه! اگر کسی به شما گفت من تظمین میدم بابت این سرمایه گذاری لطفا وسوسه نشید. برای سرمایه گذاری در بازار های مختلف مثل بورس، ارز های دیجیتال، مارکت های NFT و ... به هیچ وجه وام نگیرید! در اصل وام برای زمانی بهترین بازدهی رو داره که شما بخواین برای توسعه کسب و کار فعلی خودتون که سود خوبی به شما میده، وام بگیرید و به کمک وام گسترشش بدید.',
        starnote:
            'ورود به هر بازاری دانش خاص خودش رو میخواد. با حرف همسایه و دوست و آشنا نمیشه سرمایه گذاری کرد. پس اگر میخواین سرمایه گذاری مطمئن داشته باشین حتما با متخصص اون بازار مشورت کنین',
        text2:
            'پس بهتره که در تب و تاب خرید و فروش های میلیون دلاری توکن های NFT بدون دانش کافی اقدام به سرمایه گذاری پر ریسک و خطرناک نکنید و برای سرمایه گذاری تو این حوزه خیلی احتیاط کنید.',
      ),
    ],
  ),
  Nfts(
    id: 031,
    chapter: 'فصل دوم',
    title: 'مینت کردن',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'How Much Does Minting an NFT Cost?',
              'site':
                  'https://pastel.network/how-much-does-minting-an-nft-cost/'
            },
          ],
          id: 03101,
          text:
              'در ابتدا باید بدونید که خرید یک NFT با مینت کردن یک NFT کاملا متفاوت است ، در واقع با mint کردن شما یک چیز جدید در بلاکچین خلق می کنید. تبدیل کردن یک فایل دیجیتال  به یک دارایی دیجیتال در بلاکچین را Minting می گویند. یادتون باشه  NFT یک توکن است که حق مالکیت یک اثر را نشان می دهد ، پس توکن های مینت شده ارزشمند هستند و با عکس ها و اسکرین شات هایی که از اینور و اونور گرفتین فرق دارن، وقتی در خواست مینت یک آیتم را می دهید  باید مبلغی را به عنوان gas fee ( گس فی ) بپردازید در بخش های بعدی در مورد گس فی توضیح بیشتری میدیم ، البته راه های برای اینکه بتونید بدون پرداخت هزینه NFT بسازید هم وجود دارد که به آن ها هم خواهیم پرداخت',
          image: 'images/2-minting.jpeg'),
    ],
    image: '',
  ),
  Nfts(
    id: 032,
    chapter: 'فصل دوم',
    title: 'گس فی',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'NFT Gas Fees Explained',
              'site':
                  'https://www.fool.com/investing/stock-market/market-sectors/financials/non-fungible-tokens/nft-gas-fees/'
            },
          ],
          id: 03201,
          text:
              'اگر بخواهیم خلاصه بگوییم گس فی پولی است که برای مینت یک NFT  در شبکه بلاکچین اتریوم میپردازید ، ولی این پول چیست و چرا باید پرداخت شود ؟ در واقع این پولی است که به استخراج کنندگان بلاک چین برای پردازش تراکنش تعبیه شده در بلاک چین پرداخت می شود. همان طور که قبلا گفته شد بلاک چین یک شبکه غیر متمرکز است ، یک دفتر کل دیجیتال که تمام تراکنش های گذشته در آن ثبت می شود، این دفتر کل بین تمام ماینر ها (استخراج کننده ها ) توزیع شده است، این  کامپیوتر های قدرمند وظیفه مدیریت شبکه و تایید تراکنش ها را بر عهده دارد مانند ساخت یک NFT تایید خرید یا فروش  آن. مانند تمام سیستم های محاسباتی، انرژی زیادی برای محاسبه این تراکنش ها استفاده می شود، برای کمک به بازپرداخت ماینرها برای کاری که انجام می دهند، هر زمان که معامله ای درخواست شود، هزینه گاز یا همان گس فی  دریافت می شود.',
          text2:
              'بخاطر اینکه اتریوم یک شبکه  بلاکچینی معروف است گس فی بالایی دریافت می کند ،  برای فرار از این هزینه بالا دو راه وجود دارد یک این که از شبکه های بلاکچین با شهرت کمتر استفاده کنید تا هزینه کمتری بپردازید. در فصل معرفی مارکت ها ، با بازارهایی که از شبکه های مختلف بلاکچین پشتیبانی می کنند آشنا می شوید ، روش دوم استفاده از lazy minting  است که در بخش بعدی آن را توضیح می دهیم',
          image: 'images/2-gassfee.jpg'),
    ],
    image: '',
  ),
  Nfts(
    id: 033,
    chapter: 'فصل دوم',
    title: 'لزی مینت',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'What is lazy Minting',
              'site': 'https://www.lcx.com/what-is-lazy-minting/'
            }
          ],
          id: 03301,
          text:
              'برای اینکه بتوانید NFT خود را در بلاک چین ثبت کنید باید هزینه ای بپردازید ، خیلی از هنرمندان از ترس اینکه NFT هایی که ساخته اند بفروش نرود و هزینه Minting که پرداخت کرده به هدر برود ،آثار خود را به NFT تبدیل نمی کنند و از خیر NFT می گذرند.',
          text2:
              'برای جلوگیری از این اتفاق اولین بار پلتفرم OpenSea قابلیت LazyMinting را معرفی کرد ، این قابلیت به شما اجازه می دهد تا آثار خود را در سایت لیست کرده و برای فروش بگذارید و زمانی که اثر بفروش می رسد هزینه Minting  از خریدار گرفته می شود و در همان موقع اثر شما به عنوان NFT در زنجیره Mint می شود، هم اکنونه پلتفرم های دیگر هم چنین قابلیتی را به بازار خود افزوده اند.',
          starnote2:
              'بدون داشتن ابزار مناسب استفاده از قابلیت LazyMint کار دشواری است. البته برخی ابزار های اینترنت نسل 3 (Web3) این فرایند را تا حدی ساده تر می کنند.',
          image: 'images/2-lazyminting.jpg'),
    ],
    image: '',
  ),
  Nfts(
    id: 034,
    chapter: 'فصل دوم',
    title: 'ساخت ان اف تی',
    chapterDetailList: [
      ChapterDetail(
          id: 03401,
          titleSection: 'انتخاب آیتم',
          text:
              'اول باید آیتم خودتون رو آماده کنید ، نقاشی ، یک متن ، یک قطعه موسیقی، ویدیو یا هر چیز دیگری که بتواند به عنوان یک فایل چند رسانه ای تولید شود. البته مطمئن شوید که حقوق مالکیت معنوی آن مورد را دارید ',
          image: 'images/2-createNFT.jpg'),
      ChapterDetail(
        id: 03402,
        image2: 'images/mint.jpg',
        titleSection: 'انتخاب بلاک چین',
        text:
            'بعد انتخاب فایل نوبت به مینت کردن میرسه ، که در بخش قبلی به آن پرداختیم ، حالا وقتشه که مارکت مورد نظرتون رو انتخاب کنید و تصمیم بگیرید که دوست دارید آیتم خودتون رو در بستر کدام بلاک چین مینت کنید ، شما باید تمام آپشن ها را در نظر بگیرید ، مانند گس فی ، میزان عرضه و تقاضا مارکت و ... ',
        starnote2:
            'در فصل معرفی مارکت ها با بازار های معتبر آشنا خواهید شد و گفته می شود هرکدام در بستر کدام بلاک چین فعالیت می کنند ، علاوه بر این شما  می توانید با جستجو در اینترنت مارکت های بیشتری پیدا کنید',
      ),
      ChapterDetail(
        id: 03403,
        titleSection: 'آماده کردن کیف پول',
        text:
            'اگه تا الان کیف پول نداشتین ، دیگه وقتشه یکی بسازین ، وقتی که یک بلاک چین را انتخاب کردید، به یک کیف پول دیجیتالی نیاز خواهید داشت که از آن بلاک چین پشتیبانی کند تا بتوانید NFT های خود را ذخیره کنید. ',
        text2:
            'برای ایجاد کیف پول، باید اپلیکیشن کیف پول را دانلود کنید، یک نام کاربری و رمز عبور ارائه دهید، و کلیدهای خصوصی و عبارت بازیابی خود را به صورت آفلاین ذخیره کنید. کیف پول خودتان را حتمی خودتان بسازید و از کسی تقاضا نکنید این کار را برای شما انجام دهد. در نهایت رمز و عبارت پشتیبانی شما خیلی مهم است و نباید آن را در اختیار کسی قرار دهید. ',
      ),
      ChapterDetail(
        resourceInfo: [
          {
            'name': 'How to Make an NFT (fool.com)',
            'site':
                'https://www.fool.com/investing/stock-market/market-sectors/financials/non-fungible-tokens/how-to-make-an-nft/',
          },
          {
            'name':
                'How to create your own NFT in 5 simple steps - Domus (domusweb.it)',
            'site':
                'https://www.domusweb.it/en/news/2021/05/13/how-to-mint-your-own-nft-in-5-simple-steps.html',
          },
          {
            'name': 'How to Create an NFT (investopedia.com)',
            'site': 'https://www.investopedia.com/how-to-create-an-nft-6362495'
          },
        ],
        id: 03404,
        image: 'images/mint2.jpg',
        titleSection: 'آپلود و فروش',
        text:
            'بعد از انتخاب مارکت ، ساخت و اتصال کیف پول خود به مارکت نوبت به آپلود فایل انتخابی میرسه متناسب با مارکتی که انتخاب کردید مراحل آپلود رو  انجام دهید و در نهایت فایل خود را در لیست فروش قرار دهید شما می توانید توکن خود را با یک قیمت ثابت بفروشید و یا اینکه آن را به حراج بگذارید تا افراد علاقه مند آن را با بالا ترین قیمت خریداری کنند ، البته برای حراج باید یک قیمت پایه در نظر بگیرید',
      )
    ],
    image: '',
  ),
  Nfts(
    id: 041,
    chapter: 'فصل سوم',
    title: 'کیف پول مناسب ان اف تی',
    image: 'images/3-chapter3wallet.webp',
    chapterDetailList: [
      ChapterDetail(
          id: 04101,
          titleSection: 'متاماسک MetaMask ',
          text:
              'اگر به دنبال بهترین کیف پول اتریوم برای NFT هستید ، متاماسک برای شماست، زیرا یکی از پرکاربردترین پلتفرم ها برای ارسال، دریافت و ذخیره سازی NFT است  ، می توانید بر روی موبایل و وب به این کیف دسترسی داشته باشید.',
          image: 'images/3-metaMask.jpg',
          text2: 'بلاکچین : Ethereum'),
      ChapterDetail(
        id: 04102,
        titleSection: 'تراست ولت Trust Wallet',
        text:
            'تراست ولت  بهترین گزینه برای تازه واردان است ، رابط کاربری آسان و دلپسند آن به شما این امکان را می دهد که به راحتی با آن ارتباط بر قرار کنید ، در قسمت NFT کیف شما میتوانید به راحتی آیتم های خود را ببینید و مدیریت کنید. می توانید بر روی موبایل و وب به این کیف دسترسی داشته باشید.',
        image: 'images/3-Trust-Wallet.jpg',
        text2: 'بلاکچین : Ethereum ، Binance Smart Chain',
      ),
      ChapterDetail(
          id: 04103,
          titleSection: 'کیف پول بایننس Binance Chain Wallet',
          image: 'images/3-binanceWallet.jpg',
          text:
              'این کیف پول از سمت شرکت بزرگ بایننس پشتیبانی می شود و در نتیجه برای ذخیره سازی NFT هایی که در زنجیره بایننس ساخته شده اند مناسب می باشد، دسترسی به این کیف پول از راه وب امکان پذیر است.',
          text2: 'بلاکچین :  Binance Smart Chain، Binance Chain،Ethereum'),
      ChapterDetail(
        id: 04104,
        text:
            'یکی از کیف پول های معروف برای افرادی که در زمینه NFT فعالیت می کنند، از ویژگی های مهم آن بخش اختصاصی کالکشن NFT است ،کریپتو یک بازار اختصاصی NFT بر پایه بلاک چین خود دارد که همین باعث شده تا این کیف پول طرفداران زیادی داشته باشد',
        image: 'images/3-CryptoWallet.jpg',
        titleSection: 'Crypto.com DeFi Wallet',
        text2: 'پشتیبانی از بلاکچین Crypto.org Chainو Ethereum',
      )
    ],
  ),
  Nfts(
    id: 051,
    chapter: 'فصل چهارم',
    title: 'معرفی بازار های ان اف تی',
    chapterDetailList: [
      ChapterDetail(
        id: 05101,
        titleSection: 'Quint',
        text:
            'یک پلتفورم  رمزنگاری شده، که هدفش متصل کردن دنیای واقعی به متاورس هستش، یکی از کارهای جالبی که کوینت انجام میده ارائه کالکشن های سفارشی خودش است، وقتی خریدارها از NFT های کوینت خرید میکنند فقط یک نسخه دیجیتال دریافت نمی کنند بلکه یک نسخه فیزیکی قاب شده هم، دم در خونه به اونها تحویل میشه. که متاسفانه در ایران استفاده از این قابلیت امکان پذیر نیست. ',
        starnote:
            'کسانی که اقدام به خرید توکن های کوینت میکنن مجوز دسترسی به کلوپ هنری متاورس را پیدا میکنن و همچنین میتونن به بخش ویژه بازار کوینت دسترسی داشته باشن.',
        benefits: [
          'این پلتفورم بخشی از اکو سیستم لاکچری کوینت هستش.',
          'تنوع بالایی از دسته های NFT',
          'تحویل دادن نسخه فیزیکی NFT',
          'دست یابی به کلوپ متاورس با خرید NFT',
        ],
        tableList: [
          'QUINT',
          'ندارد',
          '+۱۰۰۰',
          'مشخص نیست',
        ],
        image: 'assets/images/market_place/quint.jpg',
      ),
      ChapterDetail(
        id: 05102,
        titleSection: 'Crypto',
        text:
            'سایت crypto.com یکی دیگه از گزینه های مناسب برای خرید NFT  است. این سایت جز معروف ترین بازار های ارز دیجیتال  میباشد که بیشتر از ۱۰ میلیون نفر در آن فعال هستند. در سال ۲۰۲۱ اونها بازار مخصوص NFT خودشون رو راه اندازی کردن که دسته های مختلفی  از موضوعات رو ارائه میکنن. هدف این سایت آسون کردن تمام پروسه های سرمایه گذاری است، شما میتونی کمتر از یک دقیقه اکانت بسازی. توکن ها به صورت حراج یا با قیمت ثابت در دسترس هستند، این توکن با ارز دیجیتال ، اعتبار داخل سایت و یا دبیت کارت قابل خریداری هستند.',
        starnote:
            'یکی از مهم ترین ویژگی های این سایت نبود هزینه معامله است که اون رو از بقیه بازار ها متمایز کرده. این اواخر هم بستر NFT های بر پایه اتریوم در این سایت فراهم شده و باعث شده که این بازار به سرعت گسترش پیدا کنه.',
        benefits: [
          'نداشتن گس فی',
          'نداشتن هزینه معاملات',
          'فقط کارمزد ۱/۹۹% هنگام فروش NFT',
          'امکان خرید با کارت های اعتباری',
          'پشتیبانی از NFT بر پایه اتریوم',
        ],
        tableList: [
          'Crypto.org chain & Ethereum',
          'ندارد',
          '+۱۰۰۰۰۰',
          'بیشتر از ۵۰ هزار اتریوم در هفته',
        ],
        image: 'assets/images/market_place/crypto.jpg',
      ),
      ChapterDetail(
        id: 05103,
        titleSection: 'Binance',
        text:
            'قطعا با نام بایننس آشنا هستین، بزرگترین بازار ارز دیجیتال. یکی از ویژگی های بایننس پایین بودن هزینه معاملاتش است، فقط یک درصد! این بازار همچنین از NFT هایی بر پایه اتریوم و زنجیره هوشمند بایننس پشتیبانی میکنه. در نتیجه گستره انتخاب وسیعی در اختیار معامله گر قرار میده. در حال حاضر در بایننس تنها راه خرید فروش از راه ارز دیجیتال هستش، برای مینت کردن توکن ها هم باید مقدار کمی BNB پرداخت کنید.',
        starnote:
            'یکی از جذابیت های این مارکت جعبه جادویی هست که با خرید اون به صورت تصادفی یک NFT به شما میده، اگر شانس با شما یار باشه میتونید آیتمی بسیار ارزشمند بدست بیارید.',
        benefits: [
          'هزینه معاملات کم',
          'جعبه های جادویی',
          'پشتیبانی از Binance smart chain و اتریوم',
          'امکان خرید ارز دیجیتال در خود بازار',
        ],
        tableList: [
          'Binance Smart Chain & Ethereum',
          'دارد',
          '+۱۰۰۰۰۰',
          'بیشتر از ۴۰ میلیون دلار در ماه',
        ],
        image: 'assets/images/market_place/binance.jpg',
      ),
      ChapterDetail(
        id: 05104,
        titleSection: 'Open Sea',
        text:
            'افراد زیادی معتقدن که اوپن سی (Open Sea) بهترین پلتفورم برای معامله NFT است. این بازار از نظر حجم معاملات بزرگترین بازار در جهان هستش. اوپن سی بر پایه اتریوم است و انواع مختلفی از دسته بندی های NFT  مثل هنر، نام دامنه، آیتم های داخل بازی و ....  رو ارائه میده. ',
        starnote:
            'مهمترین ویژگی این پلتفورم پشتیبانی کردن از ۱۵۰ نوع ارز دیجیتال و ۱۴ کیف پول مختلف است. هزینه معاملات ۲/۵ درصد فقط برای فروشنده ها هستش.',
        benefits: [
          'تنوع بی نظیر NFT',
          'پذیرش بیشتر از ۱۵۰ نوع ارز دیجیتال',
          'پذیرش ۱۴ نوع کیف پول',
        ],
        tableList: [
          'Ethereum',
          'برای ثبت نام اکانت و هنگام پرداخت',
          '+۱۰۰۰۰۰۰',
          'بیشتر از ۵ میلیارد دلار در ماه',
        ],
        image: 'assets/images/market_place/opensea.jpg',
      ),
      ChapterDetail(
        id: 05105,
        titleSection: 'Nifty Gateway',
        text:
            'این پلتفورم دارای طیف گسترده ای از هنرمندان و خلاقان مشهور با گذشته ای معتبر هستش که کالکشن های این بازاربیشتر برای سرمایه گذاران سطح بالا طراحی شده. این بازار جزئی از شرکت معتبر ارز های دیجیتال به نام Gemini است، در خارج از آمریکا تنها راه داد و ستد در این بازار ارز دیجیتال هست که در حساب Gemini ذخیره شده. در هر معامله ۵ درصد هزینه برای فروشنده بعلاوه  ۰/۳۰ دلار هزینه ثابت پرداخت میشه.',
        starnote:
            'یک بازار خاص برای NFT  های ویژه که در تعداد محدودی منتشر میشن.',
        benefits: [
          'توسط Gemini  پشتیبانی میشه',
          'تمرکز روی آیتم های خاص',
          'دارای کاربرهای معتبر و مشهور',
        ],
        tableList: [
          'Ethereum',
          'دارد',
          '+۶۰۰۰',
          'بیشتر از ۱۰۰ میلیون  دلار در ماه',
        ],
        image: 'assets/images/market_place/nifty-gateway.jpg',
      ),
      ChapterDetail(
        id: 05106,
        titleSection: 'Game stop',
        text:
            'یک بازار تازه تاسیس که توجه های زیادی را به خودش جلب کرده. گیم استاپ روی آیتم های داخل بازی ها مثل تجهیزات دیجیتال، اسلحه، لباس و ...  تمرکز کرده. مشخصات دقیق این پلتفرم هنوز کاملا واضح نیست ولی گفته می شود که این شرکت با غول های صنعت بازی در حال همکاری هستش.',
        benefits: [
          'بر پایه پروتوکل لایه دو اتریوم ساخته شده',
          'روی آیتم های بازی تمرکز داره',
          'با توسعه دهندگان صنعت بازی در ارتباط هستش',
          'برای توسعه دهندگان بازی سرمایه جمع آوری میکنه',
        ],
        tableList: [
          'Immutable X',
          'مشخص نیست',
          'هنوز راه اندازی نشده	',
          'مشخص نیست',
        ],
        image: 'assets/images/market_place/game-stop.jpg',
      ),
      ChapterDetail(
        resourceInfo: [
          {
            'name':
                'Best NFT Marketplaces Reviewed - Where to Buy NFTs in 2022 (business2community.com)',
            'site': 'https://www.business2community.com/nft/best-marketplaces'
          },
        ],
        id: 05107,
        titleSection: 'Rarible',
        text:
            'یک بازار ایده آل برای  سرمایه گذارها، در این پلتفورم میتونید به طیف وسیعی از انتخاب مثل آثار هنری دیجیتال، عکاسی، بازی، موزیک، دامنه ها و حتی به آیتم های متاورس دسترسی داشته باشید. در هر معامله ۲/۵ درصد هزینه معامله هم برای فروشنده و هم برای خریدار اعمال میشه.',
        starnote:
            'Rarible  علاوه بر بستر اتریوم ، NFT های بستر Flow وTezos  رو هم پشتیبانی میکنه.',
        benefits: [
          'پشتیبانی از چند زنجیره',
          'پشتیبانی از کیف پول های متنوع',
          'پشتیبانی از کارت اعتباری و دبیت کارت در بیشتر از ۱۹۰ کشور',
        ],
        tableList: [
          'Ethereum, Flow, Tezos',
          'حدود ۰/۰۱۰ اتریوم هنگام خرید توکن',
          '+۴۰۰۰۰۰',
          'بیشتر از ۳۹۰ هزار  دلار در هفته',
        ],
        image: 'assets/images/market_place/rarible.jpg',
      ),
    ],
    image: 'assets/images/market_place/chapter4.jpg',
  ),
  Nfts(
    id: 061,
    chapter: 'فصل پنجم',
    title: 'ایردراپ',
    image: 'images/5-airdrop.jpg',
    chapterDetailList: [
      ChapterDetail(
          id: 06101,
          text:
              'ایدراپ (Air Drop)  معنی لغویش یعنی چیزی که از هواپیما رها میکنند و به زمین میفرستن ، حالا این جعبه مرموز با چتر نجات چی هست ؟',
          starnote:
              'شاید در شروع کار یکی از راه های  مناسب برای ورود به دنیای NFT ، ایر دراپ ها باشند ،',
          text2:
              'توکنی که یک توسعه دهنده به صورت هدیه یا پاداش به شما بده یا اینکه بخاطر خرید و نگه داری یک آیتم به دارایی های شما اضافه کنه ایردراپ گفته می شود، ایدراپ بیشتر جنبه تبلیغاتی داره و یک جور استراتژی جلب توجه جامعه مجازی است.',
          image: 'images/5-airdrop.jpg'),
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'The Ultimate Guide to NFT Airdrops (nftplazas.com)',
              'site': 'https://nftplazas.com/guide-nft-airdrops/'
            },
            {
              'name':
                  'Airdrop Beginner Guide: What is an Airdrop and How is it Work? (one37pm.com)',
              'site':
                  'https://www.one37pm.com/nft/what-is-an-airdrop#:~:text=An%20airdrop%20is%20a%20distribution,to%20a%20brand%20or%20experience.'
            },
          ],
          id: 06102,
          text:
              'یکی از معمول ترین نوع های ایردراپ مدل استاندارد آن است که توسعه دهنده درصدی از توکن های پروژه را با اعضایی که نام نویسی کرده اند تقسیم می کند. ، بعد از ثبت نام در یک ایردراپ ممکن است  فعالیت هایی برای شما در نظر گرفته شود مانند اشتراک گذاشتن پست هایی در رسانه های اجتماعی و یا چیز هایی مشابه آن.',
          text2:
              ' بعد از انجام این فعالیت ها شما باید منتظر باشید شرکت توکن هایش را با شما به اشتراک بگذارد، گاهی می توان توکن های با ارزشی در ایردراپ دریافت کرد اما به طور کلی نباید انتظار چیز چشم گیری را داشته باشید. ',
          starnote2:
              'ایردراپ های استاندارد هرگز از شما پولی نمیگیرند اگر با صفحه درخواست وجه روبرو شدید مطمئن باشید که یک کلاهبرداری است و سریع آنجا را ترک کنید . ')
    ],
  ),
  Nfts(
    id: 071,
    chapter: 'فصل شش',
    title: 'نکات خرید و فروش',
    image: 'images/6-tipsOfTrade.png',
    chapterDetailList: [
      ChapterDetail(
          id: 07101,
          titleSection: 'تخصص و شهرت تیم ',
          text:
              'بر خلاف گذشته این روزها خیلی از افراد بی نام و نشان و بدون هویت مشخص توانستند رشد کنند بدون آنکه کسی آنها را بشناسد، بطور مثال Board Ape Yacht Club یک کالکشن NFT بود که تا قیل از فاش شدن هویت سازندگان قیمت پایه هرکدام از توکن ها  به 300 هزار دلار می رسید در عین حال هیچ کس از هوین سازندگان آن اطلاعی نداشت. در نتیجه می توان گفت بجای تمرکز کردن روی هویت و تیم ها بهتر است رو شهرت و دست آورد هایشان تمرکز کنید، توسعه‌دهندگانی که ناشناس می‌مانند ممکن است به‌طور باورنکردنی حرفه‌ای و کار بلد باشند. کلاهبرداران را می توان حتی در تیم های عمومی پیدا کرد. ',
          starnote:
              'به جای تصمیم گیری فوری بر اساس این عوامل، تحقیقات گسترده ای را برای تعیین اینکه آیا تیم ارزش  دارد یا خیر انجام دهید.',
          text2:
              'نکته دیگری که باید در مورد آن فکر کنید این است که آیا آنها هرگونه مشارکت یا همکاری را با شرکت های بزرگ اعلام کرده اند یا نه. ممکن است آنها در حال  همکاری با کسب و کارها و یا مشارکت با توسعه دهندگان شناخته شده و با سابقه باشند.'),
      ChapterDetail(
        id: 07102,
        titleSection: 'نفوذ در جامعه',
        text:
            'اگر بپرسید چرا BAYC اینقدر معروف است ، مطمئنا پاسخ  محبوبیت در جامعه است . مردم لوگو های BAYC را دوست دارن و با افتخار عکس میمون هاشون رو روی عکس های پروفایلشان می گذارند.',
        image2: 'images/6-2-image.png',
        starnote2:
            'هنگام انتخاب پروژه ای برای سرمایه گذاری، به دنبال جامعه ای باشید که تمام تلاش خود را می کند تا مجموعه را به خوبی معرفی کند و مهمتر از آن، آن را به جلو هدایت کرده و از آن حمایت کند.',
        text2:
            'البته باید دقت کنید که بیشتر جوامع NFT در دیسکورد هستند و تعداد زیادی از پروژه ها از ربات استفاده می کنند تا جوامع خودشون رو پویا نشون بدن، اگر آنها را با دقت بررسی کنید، ربات ها به راحتی قابل تشخیص هستند.',
      ),
      ChapterDetail(
        id: 07103,
        titleSection: 'نقشه راه ',
        text:
            'پروژه های خوب دارای برنامه ریزی های سنجیده شده ای هستند. البته همیشه اینگونه نیست و نمیشه گفت تمام پروژه های عالی با یک برنامه ریزی دقیق شروع شدند، ',
        text2:
            'ولی باید همیشه به نقشه های راه دقت کنید که آیا انجام تمام ادعا هایی که در یک مدت زمان مشخص وعده داداند شدنی است یا نه ، اگر با یک نقشه راهی مواجه شدید که در مدت زمان خیلی کوتاه ، ادعا های خیلی عظیمی داشت ، بهتر است در تصمیمتان برای سرمایه گزاری تجدید نظر کنید.',
      ),
      ChapterDetail(
        id: 07104,
        text:
            'اتریوم در اکثریت قریب به اتفاق در  بسیاری از کالکشن های موفق NFT  استفاده شده است . حجم معاملات در بستر اتریوم نسبت به رغبا بسیار بالاتر است. سولانا یا پروژه های دیگر مثل Binance Smart Chain  ( زنجیره های هوشمند بایننس)  در تلاشند تا دنباله رو اتریوم باشند  ولی شهرت و حجم معاملات کمتری نسبت به اتریوم دارند.',
        titleSection: 'بر اساس کدام زنجیره هستند ؟',
      ),
      ChapterDetail(
        id: 07105,
        titleSection: 'حجم و قیمت',
        text:
            'وقتی وارد بازار می شوید توکن های که به اصطلاح به آنها bluechip (ژتون آبی ) گفته می شود نسبت به بقیه آیتم ها در بازار قیمت و حجم معاملات بالاتری دارند',
        starnote:
            'بلو چیپ به NFT های  شناخته شده، تثبیت شده، پایدار گفته می شود، که به عنوان یک سرمایه گذاری بلند مدت خوب در نظر گرفته می شوند.',
        text2:
            'به یاد داشته باشید که  NFT مانند ارز های دیجیتاال نیست که با فشردن کلیک فروش بتونید آن را به فروش برسانید ، در بازار NFT شما باید توکن خود را برای فروش بگذارید و برایش یک خریدار پیدا کنید، به همین دلیل خیلی مهم است که کالکشن هایی رو انتخاب کنید که حجم معاملات بالایی دارند . اگر وارد یک کالکشن شوید که حجم معاملاتش به تدریج رو به کاهش است این خطر شما رو تهدید می کند دیگر نتوانید آن را بفروشید.',
      ),
      ChapterDetail(
        id: 07106,
        titleSection: 'چرخش  قیمت ',
        text:
            'سرمایه گذاری در NFT یک بازی کاملا جدیده که ناگفته های بسیاری دارد، وقتی یک توکن را به قیمت پایین تر میخرید و بعد آن را با قیمت بالاتر میفروشید به اصطلاح به آن چرخش قیمت یا flipping میگویند ولی این نصیحت ما را جدی بگیرید ، این کار نیاز به تحقیقات گسترده و غوطه ور شدن در بازار NFT است ',
        starnote:
            'این جمله از مانترا " شایعه را بخر و خبر را بفروش " در اینجا کاربرد دارد. ',
        starnote2:
            'صادقانه بگوییم که این کار بسیار سختی است و به تلاش و تجربه بالایی نیاز دارد.',
      ),
      ChapterDetail(
          id: 07107,
          text:
              'با استفاده از جستجوی عکس گوکل می توانید اطلاعات مهمی راجب به عکس پیدا کنید و ببینید که چقدر تنوع یا توکن های مشابه نمونه مورد خرید شما وجود دارد و یا چه مدت است که این تصویر در اینترنت وجود دارد.',
          titleSection: 'جستجوی معکوس در گوگل ',
          image: 'images/6-7-Reverse-Image-Search.png',
          resourceInfo: [
            {
              'name':
                  'NFT Tips: 15 Pro Tips for Beginners + How to Invest in NFTs (justcreative.com)',
              'site': 'https://justcreative.com/nft-tips-how-to-invest-in-nfts/'
            },
            {
              'name':
                  'Investing in NFTs: 12 Must-Read Tips to Spot the Best Projects (cryptopotato.com)',
              'site': 'https://cryptopotato.com/nft-investmnet-tips/'
            },
            {
              'name':
                  '9 Tips for buying and trading NFTs like a Pro (swappable.io)',
              'site':
                  'https://swappable.io/blog/safety-tips-for-buying-selling-nfts-2/'
            },
          ])
    ],
  ),
  Nfts(
    id: 081,
    chapter: 'فصل هفتم',
    title: 'مقدمه',
    image: 'images/7-Scams1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 08101,
        titleSection: 'کلاهبرداری های معمول در NFT',
        image: 'images/7-Scams1.jpg',
        text:
            'از زمانی که محبوبیت NFT بین مردم زیاد شد،کلاهبردارن هم به این تکنولوژی علاقه مند شدن، این روز ها باید مراقب NFT های تقلبی ، راگ پول ، پامپ اند دامپ و خیلی کلاهبرداری م مشکلات دیگر در این صنعت باشیم ، در این بخش با ما همراه باشید تا انواع کلاهبرداری های رایج در این حوزه آشنا شوید',
        starnote:
            'صنعت NFT در سال 2020  پایش را روی پدال گاز گذاشت و بیشتر از %300 از سال قبل خود رشد کرد ولی بعد از چند هفته ابتدایی ماه می سال 2022 فروش این توکن ها 92 درصد نسبت به سال قبل خود کمتر شد و همین طور شمار کیف های فعال معاملاتی از 119000 به 14000 کاهش پیدا کرد.',
        text2:
            'با این وجود این بازار هنوز هزاران میلیارد دلار سرمایه در گردش دارد که بستر بسیار خوبی برای کلاهبرداران است، این موضوع نگرانی های امنیتی زیادی را با خود به همراه دارد، در دنیای واقعی دزد برای اینکه بتواند اثر هنری را بدزدد باید از سد دیوارها، حفاظ ها و دوربین های موزه بگذرد ولی امروزه  می توان با استفاده از مالورها و یا تکنیک های مهندسی شده اجتماعی یه کیف های پول دیجیتال نفوذ کرد.',
      ),
      ChapterDetail(
        id: 08102,
        text:
            'وقتی هنرمند زمینه دیجیتال "قین ها " (Qin ha) در سال 2020 درگذشت کلاهبرداران از این فرصت استفاده کردند و آثار هنری اورا از جانب او به صورت NFT فروختند،  در سپتامبر 2022 وبسایت نقاش خیابانی آقای "بنکسی" (Banksy) هک شد و یکی از آثارش که قرار بوئ به عنوان اولین NFT او باشد به قیمت 336 هزار دلار فروخته شد.',
        image2: 'images/7-intro-banksy.jpg',
        text2:
            'فقدان قوانین و مقررات در بازار NFT فرصت های مناسبی برای انواع کلاهبرداران ایجاد کرده است، از این رو کمپانی های بزرگ مانند Adobe  در تلاشند تا با خلق مهرهای احراز هویت، به این توکن ها مشروعیت ببخشند،با تمام این تمهیدات ضد کلاهبرداری ، این بازار به سرعت در حال گسترش و بزرگ شدن است که به شدت به رفتار کاربران وابسته است ، در ادامه چند کلاهبرداری معمول را با هم بررسی میکنیم.',
      ),
    ],
  ),
  Nfts(
    id: 082,
    chapter: 'فصل هفتم',
    title: 'روش های کلاهبرداری ',
    image: 'images/7-Scams1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 08201,
        titleSection: '	پیام های شخصی در دیسکورت ',
        image: 'images/7-discord.jpg',
        text:
            'به طور کلی دیسکورت جذابیت خاصی برای مجرمان سایبری دارد و راه های مختلفی برای کلاهبرداری می توان در آن یافت، دیسکورت به جوامعی تقسیم شده که به آن سرور می گویند، در سرورها افراد می توانند با هم صحبت کنند، بازی کنند و بازیشان را به نمایش بگذارند.',
        starnote:
            'در دسامبر 2021 یک سرور دیسکورتمربوط به یک بازی NFT که به تازگی راه اندازی شده بود، 373 373 نفر متوجه شدن که احراز هویت کیف پولشان با خطر مواجه شده ، در این حمله سایبری 150 هزار دلار سولانا به سرقت رفا.',
        text2:
            'یک راه دیگر دزدی از راه پیام شخصی است، در این شرایط فرد کلاهبردار سعی می کند خود را به عنوان یک هنرمند، اینفلوئنسر یا یک برند بزرگ جا بزند و مخاطب را فریب دهد، شما هرچقدر در جامعه های بزرگتری از دیسکورت باشید پیام های کلاهبرداری بیشتری دریافت خواهید کرد ، در نهایت باید مراقب باشید به هیچ پیامی از غریبه ها و یا مبتنی بر خرید و فروش و دریافت پول در دیسکورت جواب ندهید، قبل از خرید هر توکن از اعتبار و مشروعیت آن اطمینان حاصل کنید.',
      ),
      ChapterDetail(
          id: 08202,
          image: 'images/7-fakeaccount.jpg',
          titleSection: 'پروفایل های جعلی در رسانه های اجتماعی ',
          text:
              'کاربران شبکه های اجتماعی، حالا چه در توییتر، اینستاگرام یا هرجای دیگری باید مراقب اکانت های جعلی باشند، بیشتر این  پروفایل ها کپی ورژن اصلی می باشند، اگر کمی مراقب باشید و به جزئیات دقت کنید می توانید آنها را تشخیص دهید ،',
          starnote:
              ' گاهی فقط یک حرف پس و پیش بودن در اسم پروفایل می تواند زنگ خطری باشد برای شناسایی این گونه اکانت ها ',
          text2:
              'علاوه بر این ، ربات هایی هستند که در غالب کاربر های شبکه های اجتماعی با شما ارتباط برقرار میکنند و با اطلاعاتی که از شما درخواست میکنند می توانند به کیف پول  شما دسترسی پیدا کنند، اگرچه آنها بازیگران بدی هستند و کم موفق به فریب افراد می شوند ولی همان تعداد اندکی که فریب م خورند پول خوبی نصیب کلاهبرداران می کنند. یکی دیگر از روش های معمول این است که فرد کلاهبردار به قربانی پیام می دهد و به گونه ای رفتار میکند که گویی در زمینه ارزهای دیجیتال و یا مسائل وابسته به آن نیاز به کمک دارد.',
          starnote2:
              'قبل از ارتباط با هر فرد ، تعداد فالورها ، تعداد Tweet ها ، retweet ها و یا اینکه اکانت درای محتوای اصلی است را چک کنید.'),
      ChapterDetail(
          id: 08203,
          titleSection: 'فیشینگ',
          text:
              'یکی دیگر از تاکتیک های پرکاربرد کلاهبرداری کپی کردن وبسایت های معتبر است، کلاهبردارن سایت هایی دقیقاً مشابه با سایت های اصلی طراحی می کنند، در توییتر و دیسکورت پر است از لینک  کیف پول و NFT  جعلی که سطح شباهت آنها به لینک کمپانی واقعی حیرت آور استو فقط با چشمان تیز بین و دقت بالا می توان تفاوت آنها را تشخیص داد.',
          text2:
              ' برای همین خیلی مهم است که همیشه قبل از کلیک کردن بر روی لینک حتمی آن را چک کنید، به ویژه وقتی که سایت از ما اطلاعات شخصی بخواهد. ',
          starnote2:
              'هرگز این قانون طلایی را فراموش نکنیدکه هیچ وقت رمز کیف پول و یا کد فراموشی خود را هیچ جا خارج از کیف پول خودتان استفاده نکنید.'),
      ChapterDetail(
        id: 08204,
        titleSection: 'جعل هویت هنرمندان ',
        text:
            'همانند بنکسی هنرمندان دیگری هم درگیر چنین شرایطی شدند، به طور مثال Tyler Hobbs طراح پروژه Fidenza از پلتفرم Sol Blocks بخاطر سو استفاده از کد های او و فروش جعلی آثارش شکایت کرد، و همینطور آثار هنری درک هافمن با یک اکانت جعلی که حتی تیک آبی هم داشت فروخته شد. اینگونه کلاه برداری ها اینقدر زیاد است که می توان از آن یک لیست بالا بلند ساخت.',
      ),
      ChapterDetail(
        id: 08205,
        titleSection: 'پامپ اند دامپ ',
        text:
            'در پامپ اند دامپ (Pump and Dump ) یا همان بالا بردن و خالی کردن ، یک شخص یا گروهی تعداد زیادی NFT خریداری میکنند و بعد آن را به صورت مداوم به خودشان می فروشند ، با این خرید فروش های جعلی که همه خریداران و فروشنده ها افراد یکسانی هستند این توکن ها مورد توجه قرار می گیرند و خریداران واقعی فکر میکنند با یک توکن پرطرفدار روبرو هستند و آن را با قیمت بالایی می خرند اما بعد از آن آن گروه یا شخص کلاهبردار دیگر اقدام به خرید آن آیتم نمی کنند و پشت آن را خالی می کنند در نتیجه قیمت توکن به شدت افت می کند.',
        image2: 'images/7-pump-dump.jpg',
        starnote:
            'رابرت ایوان : خیلی از این فروش های عظیم NFT افرادی هستند که دارند به خودشان میفروشند، چنین تحرکاتی یا نشان دهنده پول شویی است یا پامپ اند دامپ',
        text2:
            'در یکی از کلاه برداری ها به این سبک فردی 500 میلیون دلار کریپتو پانکی را به عنوان طعمه قرار داد ، کسی که خرید را انجام داد به سرعت پول ها را دوباره به کیف پول خودش انتقال داد، در واقع این فقط یه حرکت نمایشی برای جلب توجه خریداران بود',
      ),
      ChapterDetail(
        id: 08206,
        titleSection: 'راگ پول ',
        text:
            'راگ پول (Rug pull) یک روش کلاه برداری معمول دیگر مثل پامپ اند دامپ می باشد، در این روش کلاه بردار یک پروژه را تبلیغ می کند و سر زبان ها می اندازد و در خواست سرمایه گذاری میکند و در نهایت بدون هیچ مسئولیتی پروژه را رها می کند ،',
        starnote:
            'راگ پول را اگر بخواهیم لغوی ترجمه کنیم به معنی کشیدن قالی از زیر پا می شود که کاملا مفهوم را می رساند.',
        text2:
            ' توسعه دهنده ها زمانی پروژه را رها می کنند که مطمئن شوند سرمایه گذاران را به صورت کامل تخلیه کردند و سپس پروفایلشان را از بازار ها و شبکه های اجتماعی پاک می کنند. یکی از معروف ترین نمونه این نوع کلاهبرداری مربوط می شود به ارز دیجیتال "Squid game" که از سریال شناخته شده بازی ماهی مرکب الهام گرفته بود.ارزش این ارز در دو هفته به 2800 دلار رسید ولی ناگهان همه چی  از بین رفت ، تمام اکانت های شبکه اجتماعی و وب سایت هایش بدون هیچ اثری نا پدید شد، در این کلاهبرداری 3.3 میلیون دلار به سرقت رفت .',
      ),
      ChapterDetail(
        id: 08207,
        titleSection: 'کلاهبرداری مناقصه ها ',
        text:
            'در حراج فروشنده سعی دارد یک NFT واقعی را  به فروش برساند و نوع ارز دیجیتال را برای پرداخت نیز مشخص می کند ولی فرد کلاهبردار می تواند ارز پیشنهادی خود را به واحدی با ارزش کمتر تغییر دهد',
        text2:
            'یک راه دیگر پاک کردن و اضافه کردن NFT از بیست بازار است. در این حین کلاهبردار  قیمت را یک رقم اعشار به سمت راست می برد، تغییری که ممکن است خریدار متوجه آن نشود و هزینه ای خیلی بیشتر از مبلغی که ابتدا دیده بود بپردازد.',
      ),
      ChapterDetail(
          id: 08208,
          titleSection: 'دزدی اکانت شبکه اجتماعی ',
          text:
              'در این روش کلاهبرداران اکانت های معروف را هک کرده و اقدام به انتشار هدایا و پیشنهادات جعلی  در آن اکانت میکنند، کاربران با توجه به اعتمادی که به آن اکانت ها دارند وارد لینک های جایزه می شوند، بلافاصله از آنها در خواست رمز و اطلاعات شخصی می شود، و در نهایت بدون اینکه جایزه ای دریافت کنند تمام اطلاعات خود را دست کلاهبرداران می سپارند.',
          image2: 'images/7-socialhijack.png',
          text2:
              'ترجمه عکس : اکانت دیسکورت ما در معرض خطر است ، روی هیچ لینکی کلیک نکنید و مینت انجام ندهید.تهدیدات پاک شده اند ، با این وضع ما پیوسته سرور را تحت نظر می گیریم تا همه چیز کاملا امن شود، لطفا هر اعلامیه جدیدی از ما دیدید چند بار درستی آن را بررسی کنید.'),
      ChapterDetail(
          id: 08209,
          titleSection: 'مینت جعلی',
          image: 'images/7-sleepNFT-Minting.jpg',
          text:
              'Sleepminting ( مینت جعلی)  یکی از پیچیده ترین روش های کلاهبرداری است که شناسایی آن به این راحتی ها هم نیست ،در این روش شخص کلاه بردار بجای اینکه NFT هارا در کیف پول خودش ضرب کند (مینت کند) آنها را در کیف پول هنرمند یا شخصی مشهور مینت میکند، با اینکار به نظر میرسد که آن شخص مشهور خودش این توکن ها را ضرب  کرده ',
          text2:
              'سپس کلاهبردار مالکیت آن NFT هارا به نام خودش تغییر می دهد بدون آنکه آن هنرمند روحش هم خبردار شود. این فرایند توسط یک قرارداد سفارشی شده توسط کلاه بردار انجام می شود که به او این اجازه را می دهد که  آزادانه توکن ها را بین کیف های پول انتقال دهد. از آنجایی که کیف های پول افراد مشهور همیشه زیر ذره بین است در نتیجه توجه همگان به این NFT ها جلب می شود.',
          starnote2:
              'یکی از راه هایی شناسایی این گونه تقلب ها بررسی جزئیات توکن است ، با مطالعه قسمت سوابق انتقال توکن و اینکه آیا توکن  با همان آدرس کیف پول هنرمند مینت شده است یا نه شاید بتوانید سر نخ هایی پیدا کنید.'),
      ChapterDetail(
        id: 08210,
        titleSection: 'سو استفاده از اعتماد',
        text:
            'یکی از روش های کلاه برداری متداول در کشور ما سو استفاده از اعتماد است، وقتی فردی اطلاعات کافی برای ورود به بلاکچین ندارد از افراد متفرقه در خواست می کند تا برای او کیف پول بسازند در این فرایند شخص کلاه بردار به گونه ای رفتار می کند که رمز شما رو ندیده است و اجازه می دهد شما رمز خودتان را انتخاب کرده و وارد کنید اما نکته اینجاست که او کد بازیابی شما را برای خود ذخیره می کند و بدون نیاز به داشتن رمز شما می تواند به کیف پول شما وارد شده و تمام دارایی شما را یه سرقت ببرد ',
        starnote: 'شما هیچ مدرکی ندارید که بتوانید آن شخص را متهم کنید.  ',
        text2:
            'پیشگیری از این گونه کلاه برداری بسیار ساده است ، اطلاعات خود را بالا ببرید و خودتان حساب های شخصی خودتان را بسازید و اطلاعات خود را در جای مطمئن نگه داری کنید',
      ),
    ],
  ),
  Nfts(
      id: 083,
      chapterDetailList: [
        ChapterDetail(
            id: 08301,
            text:
                'هیچ کس نمی خواهد یک ایده بالقوه انقلابی را از دست بدهد.مطمئناً همه دوست دارند از فرصت های جدید برای سرمایه گذاری استفاده کنند، خبر خوب این است که ثروت های زیادی در دنیای کریپتو نهفته است ولی کلاه برداران هم از این موضوع با خبر هستند و از ترفند های زیادی استفاده می کنند تا از پول شما سود ببرند. ',
            text2:
                'خوشبختانه اگر حواستان جمع باشد می توانید از این کلاهبرداری ها دوری کنید، همیشه هوشیار باشید، تا اطلاعات کامل بدست نیاورده اید خرید نکنید ، مطئن باشید که به اندازه کافی راجع به پروژه مورد نظر تحقیق کرده باشید و در نهایت مهم تر از همه از اطلاعات شخصی و رمز هایتان به خوبی محافظت کنید.',
            image: 'images/7-finalnote.jpg',
            resourceInfo: [
              {
                'name':
                    'Sleepminting: How to Avoid the End of NFTs » Learning Cryptos',
                'site':
                    'https://www.learningcryptos.com/sleepminting-how-to-avoid-the-end-of-nfts/'
              },
              {
                'name': 'NFT scams: 10 types + how to avoid NFT fraud | Norton',
                'site':
                    'https://us.norton.com/internetsecurity-online-scams-nft-scams.html'
              },
              {
                'name': '7 Most Common NFT Scams (beincrypto.com)',
                'site': 'https://beincrypto.com/learn/nft-scams/'
              },
              {
                'name':
                    '7 NFT scams: How to spot them and keep your assets safe | finder.com',
                'site': 'https://www.finder.com/nft-scams'
              },
              {
                'name':
                    'Common NFT scams and how to avoid them | WeLiveSecurity',
                'site':
                    'https://www.welivesecurity.com/2022/05/23/common-nft-scams-how-avoid-them/#:~:text=Fake%20bids%20in%20NFT%20auctions,one%20with%20a%20lower%20value.'
              },
              {
                'name':
                    'How To Spot A ‘Fake’ NFT Mint. Just follow whale activites, and you’ll… | by The Prometheus Project | Medium',
                'site':
                    'https://medium.com/@ThePrometheusProject/how-to-spot-a-fake-nft-mint-5615f6417be0#id_token=eyJhbGciOiJSUzI1NiIsImtpZCI6IjQwMmYzMDViNzA1ODEzMjlmZjI4OWI1YjNhNjcyODM4MDZlY2E4OTMiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2FjY291bnRzLmdvb2dsZS5jb20iLCJuYmYiOjE2NjE0MzEyNjYsImF1ZCI6IjIxNjI5NjAzNTgzNC1rMWs2cWUwNjBzMnRwMmEyamFtNGxqZGNtczAwc3R0Zy5hcHBzLmdvb2dsZXVzZXJjb250ZW50LmNvbSIsInN1YiI6IjExMDY3NzI1MjY3MDkwMzA4NDYyMSIsImVtYWlsIjoic2luYS56cnBAZ21haWwuY29tIiwiZW1haWxfdmVyaWZpZWQiOnRydWUsImF6cCI6IjIxNjI5NjAzNTgzNC1rMWs2cWUwNjBzMnRwMmEyamFtNGxqZGNtczAwc3R0Zy5hcHBzLmdvb2dsZXVzZXJjb250ZW50LmNvbSIsIm5hbWUiOiJzaW5hIHpwIiwicGljdHVyZSI6Imh0dHBzOi8vbGgzLmdvb2dsZXVzZXJjb250ZW50LmNvbS9hLS9BRmRadWNxd3F1R0Yya0tFTDJBQzhDbmZ5QU1BRFVVRjF0bmhhR3RfVGpoSktBPXM5Ni1jIiwiZ2l2ZW5fbmFtZSI6InNpbmEiLCJmYW1pbHlfbmFtZSI6InpwIiwiaWF0IjoxNjYxNDMxNTY2LCJleHAiOjE2NjE0MzUxNjYsImp0aSI6ImMzZGM5NTEyMTQ5N2JhOTczNWIxZjAyNzBlNTM3MWRiNDU5MmRhNzEifQ.iM5YOCbX_UqVM1GnJG39kkDfMAGPsU21ILvrX8uJMOV9gMgEuKrPWdgwZlMImiX0cLYQx7LScug6y32EA-2crshGtAHdDbo2HsZFk8jw7E4D2wrCqiaqypWILUgz29cRzb_ooZF76x7QVF3K2Hs-DOcNpt7pHPKxKilR-ZeaxqXzsDEucPFDEebfb5qCiUHhE6svT1TsGkZE_vy6z39N470DlkaiOPjfvdtGB0wWpI32HKAWpgmXKUG6WjLcbi-Pv0Or8r5ieR8o3FpXpaQ-O2GcmzZInGOF8ZGbpiRKkPBaQAlWJdhX9hcx49M2ta8mKfVRlxvDOc2m6YngY8Fuyw'
              },
              //{'name': '', 'site': ''},
            ])
      ],
      chapter: 'فصل هفتم',
      title: 'روش های کلاهبرداری ',
      image: 'images/7-finalnote.jpg')
];

/*     ChapterDetail(
          titleSection: '',
          image: '',
          text: '',
          starnote: '',
          text2: '',
          starnote2: ''),  */
/* List<Nfts> nftsData = [
  Nfts(
    chapter: 'فصل اول',
    title: 'NFT چیست؟',
    descriptions: [
      'NFT  به معنی توکن های غیر قابل معاوضه می باشد این توکن ها روی فناوری بلاکچین رمزگذاری و ذخیره شده اند . آیتمی که قابل معاوضه باشد را می توان با یک  چیز دیگر مبادله و جایگزین کرد به طور مثال یک بیت کوین را میتوان با یک بیت کوین دیگر مبادله کرد یعنی اینکه یک بیت کوین که رد کیف پول شما است با یک بیت کوین که در کیف پول دوست شما است تفاوتی ندارد و شما میتوانید آنها را معاوضه کنید ولی آیتم های غیر قابل تعویض کاملا یکتا و منحصر به فرد هستند و فقط یکی از آنها وجود دارد پس اگر آن را با چیز دیگری معاوضه کنید کاملا آیتمی متفاوت با ارزش متفاوت بدست می آورید، نکته جذاب دیگر راجب به NFT ها این است که حتی وقتی توسط کسی خریده می شود همچنان در دست رس هستند و افراد دیگر می توانند کاملا آزادانه آنها را مشاهده کنند.',
      'یکی از برتری های کالکشن های دیجیتال نسبت به کالکشن های فیزیکی اسن است که NFT جزئیاتی را شامل می شود که آن را قابل ردیابی می کند، یعنی با استفاده از مشخصات منحصر بفرد آن میتوان NFT را تا مبدا آن ردیابی کرد و این موضوع مهم از پخش کالکشن های جعلی جلوگیری میکند یا به زبان دیگر می توان گفت دو NFT قابل جایگزینی نیستند، زیرا هویتی متفاوت دارند.',
      'حتی NFT های داخل یک سیستم یا کالکشن با هم متفاوت هستند، می توان NFT ها را با بلیط هواپیما مقایسه کرد، هرکدام شامل اطلاعاتی مانندد: شماره بلیط، نام مقصد، نام صاحب بلیط، روز و ساعت پرواز میباشند، بخاطر این جزئیات دو نفر نمی توانند بلیط های خود را با هم عوض کنند.',
    ],
    image: 'images/chapter1.png',
  ),
  Nfts(
    chapter: 'فصل دوم',
    title: 'توابع NFT چگونه هستند؟',
    descriptions: [
      'گواه اثبات کار (PoW) شکلی از افزودن بلاک های جدید به زنجیره بلاک چین است که به عنوان یک روش اعتبار سنجی معتبر شناخته می شود ، این مکانسیم نشان می دهد که چه مقدار تلاش ،انرژی و زمان برای رسیدن به یک هدف صرف شده است.',
      'در معاملات  NFT، مانند  بیت کوین قبل از اینکه معامله تایید و ثبت دفترکل بشود هر استخراج جدید باید سهم خود را در یک معادله رمزنگاری شده، نشان داده شود.',
      'پس از انجام معاملات ، NFTها در کیف پول دیجیتال مانند الباقی رمز ارزهای دیجیتالی محافظت و نگه داری می شوند.که در مقایسه با اقلام فیزیکی  از نظر سارقان پنهانند.',
      'مقدار فراوانی NFT در بلاکچین در بستر اترییوم وجود دارد که باعث شده مردم بتوانند دارایی های خود را به صورت الکترونیکی و هوش مندانه در بستر های مختلف معامله کنند.',
      'CryptoKitties یکی از مثال های متداول NFTهای اترییوم هستند. در این نرم افزار، هر شخص می تواند خرید و فروش گربه های دیجیتالی انجام بدهد. حتی یک گربه دیجیتالی با قیمت 17.000 دلار فروخته شده.',
    ],
    image: 'images/chapter2.png',
  ),
  Nfts(
    chapter: 'فصل سوم',
    title: 'چراNFT  ها ارزشمند هستند؟',
    descriptions: [
      'NFT انقلابی در صنعت بازی وکلکسیون بوجود آورد و توجه کاربران و کمپانی های حوزه ارز دیجیتال را به سمت خود جلب کرد. تا سال 2017 بیشتر از 200 میلیون نفر در این حوزه سرمایه گزاری کرده بودند.',
      'تکنولوژی بلاکچین باعث شد که بازیکنان بازی های کامپیوتری و کلکسیونر ها بتوانند محصولات داخل بازی را بطور دائمی در اختیار بگیرند و از آنها کسب درآمد کنند. مانند بازی Sandbox در آن می توانند آیتم های مجازی خود مثل آواتار،لباس ها و ارز های رایج بازی را بفروشند.',
      'هنرمندان هم بخوبی از بلاکچین سود می برند، از آنجایی که این تکنولوژی بستری فراهم میکند تا هنرمندان بتوانند آثار هنری خود را به صورت یک اثر الکتریکی به تمامی خریداران بین المللی به نمایش بگذارند و سود خیلی بالاتری نسبت به فروش آنها در گالری های واقعی ببرند، قسمت جداب داستان اینجاست که هربار NFT توسط خریدار جدید معامله شود درصدی به صاحب اثر سود می رسد.',
    ],
    image: 'images/chapter3.png',
  ),
  Nfts(
    chapter: 'فصل چهارم',
    title: 'جدول زمانی فروشهای قابل توجه NFT',
    descriptions: [
      '30 دی (20th January)، خالق ریک و مورتی 10 نقاشی را با قیمت 1.65 میلیون دلار با Nifty Gateway که یک پلتفورم NFT برای هنرهای زیبا و کلکسیونها می باشد، فروخت.',
      '19 بهمن (8th February)، بزرگترین ایالت مجازی با قیمت 1.5 میلیون دلار معامله شد. کاربری با نام Flying Falcon، 9 طرح پیدایش Axie Infinity (کمیاب ترین نقشه زمین در بازی) خریداری کرد.',
      '10 فبریه، لینسی لوهان عکسی از خودش را با مبلغ 58947 دلار فروخت.',
      '19 فبریه، یک اثاثه مجازی کلکسیونی با مبلغ 450 هزار دلار فروخته شد.',
      '19 فبریه، هنرمند کریس تورس، نسخه بازسازی شده Nyan Cat meme را با قیمت 587241 دلار فروخت.',
      '26 فبریه، NFT یک اسب مسابقه در zed.run با مبلغ 30780 دلار فروخته شد.',
      '22 فبریه، ویدیو کلیپی از بهترین شوت لی بران جمیز در لیگ NBA مبلغ 208 هزار دلار بدست آورد.',
      '27 فبریه، یک هنرمند جواد اهل سیاتل و سه کار آفرین جوان که با نام RTFK شناخته می شوند، مبلغ 3.1 میلیون دلار در عرض هفت دقیقه با فروش کتونی مجازی بدست آوردند.',
      '28 فبریه، بازیگر سریال گریم یک NFT کلکسیونی را با مبلغ 6 میلیون دلار فروخت.',
      '5 مارچ، رایدر ریپس، توسعه دهنده میم “Deal With It” ، میم خود را با مبلغ 22946 دلار فروخت.',
      '7 مارچ، کلکسیون ورکینگ پپ در یکی از پیشتازان مارکت NFT با نام OpenSea با قیمت 6193 دلار فروخته شد.',
      '9 مارچ، میم the bad luck brain با مبلغ 37442 دلار توسط خالق خودش و شخصی در iconic yearbook فروخته شد.',
      '11 مارچ، طراحی یک آدم فضایی از یک کلکسیون مجازی کمیاب با نام CryptoPunks به مبلغ 7.7 میلیون دلار فروخته شد.',
      '11 مارچ، کریستی، "هر روز: اولین 5000 روز" Beeple با مبلغ 69 میلیون دلار فروخت.',
      '11 مارچ، الکسیز کریستوفر، کلسیون معماری به نام Homesick را با مبلغ 340000 دلار فروخت.',
      '13 مارچ، راب گرونکوفسکی با فروش کلکسیون مجازی خودش مبلغ 1.6 میلیون دلار کسب کرد.',
      '14 مارچ، کارت بازی کریستیانو رونالدو با مبلغ 289920 دلار فروش رفت.',
      '17 مارچ، خانه شیشه رنگی به نام خانه مریخی مطعلق به کریستا کیم که اولین خانه NFT در دنیا است با مبلغ 514557 دلار توسط موسسه هنر اینترنتی خریداری شد.',
      '20 مارچ، رئیسهای موزه ماهومز شهر کانزاس یک کلکسیون هنری NFT را با قیمت 3.4 میلیون فروختند.',
      '21 مارچ، 52 دقیقه صدای ضبط شده یک ساله باد معده با قیمت 436.22 دلار فروخته شد.',
      '22 مارچ، اقتصاد دانان تیلور کرون و الکس تبروک اولین پست بلاگ خودشان را با نام Marginal Revolution به مبلغ 2300 دلار فروختند.',
      '22 مارچ، کوآرتس اولین مقاله خبری NFT را با تیتر "این مقاله به عنوان NFT به فروش می رسد" به مبلغ 1800 دلار فروختند.',
      '23 مارچ، بازیگر سریال Arrow، کتی کسیدی سه NFT عکس لختی را با قیمت 4300 دلار در حراجی فروخت.',
      '24 مارچ، جا رول نقاشی رنگ روغن خودش را با نام Fyre Festival به مبلغ 117761 دلار فروخت.',
      '25 مارچ، سه ویرایش مخصوص صفحه اول تایم با قیمت 143967 دلار، 135787 دلار و 114519 دلار فروخته شد.',
      '25 مارچ، کوین رز ستون نیویورک تایمز خودش را با قیمت 560000 دلار فروخت و به خیره اهدا کرد.',
      '25 مارچ، سوفیا اینستاسیشن، 12 ثانیه ویدیو تولید شده توسط یک هنرمند و یک ربات با نام سوفیا را به مبلغ 688888 دلار فروخت.',
      '31 مارچ، یک نان فطیر مجازی به مبلغ 4221 دلار فروخته شد.',
      '1 آپریل، یکی از اولین کلکسیون های پولکامون، پلتفرمی که پیشنهاد عکس موجودی نزدیک به پوکمون را با قیمت 140 هزار دلار فروخت.',
      '2 آپریل، کارت تیک پکمون با مبلغ 7203 دلار فروخته شد.',
      '3 آپریل، میم "Overly Attached Girlfriend" با مبلغ 400 هزار دلار فروخته شد.',
      '4 آپریل، یک کارت کلکسیونی با نام Tiger King با مبلغ 218 دلار فروخته شد.',
      '6 آپریل، لوکا گرزا اولین بسکتبالیست کالج بود که کارت NFT خودش را به حراج گذاشت و با قیمت 8345 دلار فروخت.',
      '6 آپریل، چک نویس غیر رسمی مقاله علمی NFT با مبلغ 48053 دلار فروخته شد. ',
      '6 آپریل، NFT یک اسکیت SLN با طرح "NFT چه کوفتیه؟" با مبلغ 359 هزار دلار فروخته شد.',
      ' آپریل، ساعت سازی لاکچری جیکوب اولین ساعت NFT خودش را با قیمت 100 هزار دلار در پلتفورم ArtGrails فروخت.',
    ],
    image: 'images/chapter4.png',
  ),
  Nfts(
    chapter: 'فصل پنجم',
    title: 'آینده NFT',
    descriptions: [
      'نقطه عطف توکن های غیر قابل معاوضه زمانی بود که خالق توییتر (( جک دورسی )) اولین توییت خود را به صورت NFT با قیمت 2.9 میلیون دلار فروخت. با این اتفاق مردم فهمیدند که می توانند با NFT پول در بیاورند، سلبرتی های زیادی مانند لیندزی لوهان، لیل پومپ و پاریس هیلتون شروع به ساخت و فروش NFT های خود کردند حتی ایلان ماسک هم یکی از توییت هایش را به صورت NFT برای فروش گذاشت.',
      'نکته قابل توجه اینه که خیلی از کسب و کارهای برجسته به موج NFT پیوستند و هم اکنون NFT های رسمی خود را به فروش می رسانند. یکی از این شرکت ها NBA TOPSHOT است لحظات حساس بازی های NBA و اثرات هنری دیجیتال را به شکل NFT به فروش می رساند، نمونه دیگر شرکت Taco Bell است که NFT هایی با تم تاکو منتشر کرده حتی نایک هم کفش های دیجیتالی به شکل NFT خلق کرده و نام آنها را کریپتوکیک گذاشته است. NFT همواره در حال تغییر شکل دادن است و همزمان پیچیده تر و گسترده تر می شود، امروزه شرکت های بی شماری بر روی توسعه و خلق بازی هایی بر پایه بلاکچین و استفاده از NFT فعالیت می کنند که باعث شهرت بیشتر NFT شده است، شاید روزی برسد که NFT به شکل گسترده ای بین مردم رواج پیدا کند و داشتن یک NFT مانند داشتن یک وبسایت امری معمولی به نظر برسد.',
    ],
    image: 'images/chapter5.png',
  ),
  Nfts(
    chapter: 'فصل ششم',
    title: 'گواه اثبات کار',
    descriptions: [
      'استخراج بیت کوین توسط دستگاه قدرتمندی با الگوریتم SHA256 دوبل انجام می شود. که دارای فرایند اعتبار سنجی برای تایید معاملات در حین پردازش می باشد و  قابلیت سنجش میزان استخراج بیت کوین با واحد هش بر ثانیه را دارد.',
      'برای جبران زمان و انرژی صرف شده توسط استخراج کننده ها ، در عوض هر تاییدیه آنها مقداری  بیت کوین به آنها اختصاص داده میشود .',
      'هر بلوک باید قبل از قبول شدن در بلاکچین گواه اثبات کار را داشته باشد. این اثبات کار اطلاعاتی هستند که زمان و تلاش زیادی برای کسب آنها نیاز است. زیرا اساساً این یک فرآیند تصادفی است که در آن شانس کمی برای دستیابی به هدف وجود دارد.',
      'بیت کوین از hashcash اثبات کار استفاده می کند که به نوعی الگوریتم رمزنگاری است. یکی از معمول ترین هش کش هایی که امروزه استفاده می شود Hashcash-SHA256 است.این هش کش توسط دکتر آدام بک خلق شده است. در ابتدا برای جلوگیری از سوء استفاده ایمیل اسپم استفاده می شد. به هر حال، زمان خلق hashcash برای یک ایمیل فرآیند ساده ای در پیش داشت اما ایجاد یک فرآیند برای تعداد زیاد ایمیل به طور همزمان چالش های زیادی داشت.',
      'Hashcash اثبات کار برای کمک به اطمینان اینکه بلوک های جدید سریع تر از توان و قابلیت شبکه ایجاد نشوند بکار می رود. این یعنی هر بلوک جدید فقط می تواند هر 10 دقیقه تولید شود. از زمانی که احتمال موفقیت هر نسل کاهش پیدا می کند، دانستن این موضوع که کدام تجهیزات بیت کوین در بلوک بعدی تولید می شود سخت می شود.',
      'برای پذیرفته شدن اعتبار، مقدار هش بلوک جدید باید کمتر از هدف فعلی باشد. هر بلوک به طور طبیعی باید نشان دهد که برای تولید آن کار انجام شده است. همچنین هر بلوک شامل هش بلوک قبل خود می باشد. به همین صورت زنجیره تشخیص می دهد که هر بلوک متعلق به کدام قسمت بلاکچین است. اگر یک بلوک تغییر یافته باشد، کار انجام شده برروی تمام بلوک های قبلی باید مجدد انجام شود. علاوه بر این هش های جدید و متصل شده باید برای هر کدام ایجاد شوند. این قدرت محاسباتی عظیم بدر این فرآیند نیاز است که از بلاکچین در برابر دستکاری ها محافظت شود.',
    ],
    image: 'images/chapter6.png',
  ),
  Nfts(
    chapter: 'فصل هفتم',
    title: 'حذف واسطه',
    descriptions: [
      'یکی از مهم ترین ویژگی های بلاک چین حذف واسطه  و انجام تراکنش بدون نیاز به ناظر خارجی برای  تایید فرایند است این ویژگی ها بستری برای مبادلات بدون مشکل اعتماد به واسطه ها بوجودآورده است.با حذف واسطه حذینه های وابسته به آنها هم حذف می شود برای مثال صاحبان مشاغل با هر تراکنش با کارت های اعتباری مجبور پرداخت کارمزد به بانکها می شوند ولی ارز های دیجیتال مانند بیتکوین کارمزد محدودی دارند.'
    ],
    image: 'images/chapter7.png',
  ),
  Nfts(
    chapter: 'فصل هشتم',
    title: 'کنترل بر روی داده ها',
    descriptions: [
      'به لطف پروتکل های بلاکچین، کاربران آن مالک تمام اطلاعات شخصی و اطلاعات معاملات می باشند و کاملاً بر روی آنها کنترل دارند.شرکت اوبر که بر روی بلاکچین اجرا شد یک مثال بسیار عالی است. اوبر مالک هیچکدام از ماشین هایی که با آن کسب و کار خود را شروع کرد نبود ولی با این اوصاف یکی از بهترین سرویس ها در حوضه خودرو است. '
    ],
    image: 'images/chapter8.png',
  ),
  Nfts(
    chapter: 'فصل نهم',
    title: 'یک پارچگی و کیفیت بهتر داده ها',
    descriptions: [
      'در بلاکچین  انتقال ناقص داده ها غیر ممکن است.در این تکنولوژی فقط زمانی بلاک جدید تولید می شود که به یک بلاک تایید شده در زنجیره متصل باشد.  داده ها  یکپارچه هستند زیرا باید تابع پروتوکل های بلاکچین باشند در غیر این صورت جزئی از زنجیره محصوب نمی شوند.'
    ],
    image: 'images/chapter9.png',
  ),
  Nfts(
    chapter: 'فصل دهم',
    title: 'یکپارچگی پردازش اطلاعات و معامله ها',
    descriptions: [
      'از آنجایی که بلوک ها در بلاکچین قابل تغییر نیستند، مشتریان بر روی شبکه می توانند مطمئن باشند که معاملات آن  ها بر روی شبکه به صورت یکپارچه و دقیق اجرا می شود. نیاز به هر شخص ثالثی برای بررسی تراکنشها حذف شده است که باعث حفظ یکپارچگی داده ها در طول پردازش و انتقال می شود.'
    ],
    image: 'images/chapter10.png',
  ),
  Nfts(
    chapter: 'فصل یازدهم',
    title: 'شفافیت و رهگیری',
    descriptions: [
      'تمامی تراکنش های بلاکچین در دفتر توزیع کل(Ledger) ثبت می شود که باعث شفافیت  بهبود کارایی و افزایش امنیت می شود . بستر هایی مانند سایت etherscan.io  وجود دارند که کاربران می توانند با جستجو در دیتا بیس آن تمام تراکنش های رخداده در بلاکچین را ردگیری کنند.'
    ],
    image: 'images/chapter11.png',
  ),
  Nfts(
    chapter: 'فصل دوازدهم',
    title: 'کاهش هزینه معاملات',
    descriptions: [
      'از آنجایی که هیچ طرف خارجی برای نظارت بر تراکنش‌های بلاک چین لازم نیست، کاربران می‌توانند از کاهش قابل توجهی در کارمزد تراکنش برخوردار شوند که می‌تواند میلیاردها دلار در سال صرفه‌جویی کنند.'
    ],
    image: 'images/chapter12.png',
  ),
];
 */