class ChapterDetail {
  int id;
  String? image;

  String text;
  String? starnote;
  String? image2;
  String? text2;
  String? starnote2;
  String? titleSection;
  List<String>? tableList;
  List<String>? benefits;
  List<Map<String, String>>? resourceInfo;
  ChapterDetail({
    required this.id,
    this.image,
    required this.text,
    this.starnote,
    this.text2,
    this.image2,
    this.starnote2,
    this.titleSection,
    this.tableList,
    this.benefits,
    this.resourceInfo,
  });
}

class Nfts {
  int id;
  String title, chapter, image;
  List<ChapterDetail> chapterDetailList;

  Nfts({
    required this.id,
    required this.chapterDetailList,
    required this.chapter,
    required this.title,
    required this.image,
  });
}

List<Nfts> nftsData = [
  Nfts(
    id: 011,
    chapter: 'مقدمه',
    title: 'بلاکچین چیست',
    image: 'images/0-whatIsBlockchain.jpg',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'The Street Crypto: Bitcoin and cryptocurrency news',
              'site':
                  'https://www.thestreet.com/crypto/bitcoin/what-is-a-blockchain-the-simple-explanation'
            },
            {
              'name': 'What Is Blockchain and How Does It Work? | Synopsys',
              'site':
                  'https://www.synopsys.com/glossary/what-is-blockchain.html'
            }
          ],
          id: 01101,
          image: 'images/0-whatIsBlockchain.jpg',
          titleSection: 'بلاکچین چیست',
          text:
              'اگه بخوایم خیلی ساده بگیم بلاکچین یک پایگاه اطلاعاتی توزیع شده است که دیتا ها در آن به ترتیب وقوع زمان و تاریخ ثبت می شوند، برخلاف دیتابیس های مرکزی شرکت ها، همگان می توانند به اطلاعات بلاکچین دسترسی داشته باشند و برخلاف دیتابیس های دیگر نمی توان چیزی را در بلاکچین پاک کرد یا ویرایش کرد، فقط می توان به بلاکچین اطلاعات اضافه کرد.',
          text2:
              'پایگاه اطلاعاتی توزیع شده یعنی چی؟ یعنی تمام اطلاعات در یک سرور مرکزی در یک جا ذخیره نمی شود، در بلاکچین بی شمار سرور و کامپیوتر در سرتاسر شبکه جهانی به هم متصل شده اند که به آنها نود (nod) گفته می شود.',
          starnote:
              ' از بلاکچین های معروف می توان به BNB Chain، سولانا، اتریوم، ریپل، بیت کوین و استلار اشاره کرد، البته لیست بالا بلندی از بلاکچین ها وجود دارد که متناسب با ویژگی های منحصر بفردشان، هرکدام طرفداران خودشان را دارند'),
    ],
  ),
  Nfts(
    id: 012,
    chapter: 'مقدمه',
    title: 'اتریوم چیست',
    image: 'images/0-Ethereum-1.jpg',
    chapterDetailList: [
      ChapterDetail(
        resourceInfo: [
          {
            'name': 'What Is Ethereum And How Does It Work? – Forbes Advisor',
            'site':
                'https://www.forbes.com/advisor/investing/cryptocurrency/what-is-ethereum-ether/',
          },
          {
            'name': 'What Is Ethereum? (investopedia.com)',
            'site': 'https://www.investopedia.com/terms/e/ethereum.asp',
          },
          {
            'name':
                'What Is Ethereum and What Are Its Use Cases? | OriginStamp',
            'site':
                'https://originstamp.com/blog/what-is-ethereum-and-what-are-its-use-cases/',
          },
          {
            'name':
                'What are DApps? Everything there is to know about decentralized applications (cointelegraph.com)',
            'site':
                'https://cointelegraph.com/defi-101/what-are-dapps-everything-there-is-to-know-about-decentralized-applications'
          },
        ],
        id: 01201,
        image: 'images/0-Ethereum-1.jpg',
        titleSection: 'اتریوم چیست',
        text:
            'اتریوم یک شبکه غیر متمرکز بر پایه تکنولوژی بلاکچین است و بیشتر بخاطر ارز دیجیتال بومی خود به نام اتر شناخته می شود. وجود  قرارداد های هوشمند اتریوم باعث شد که در NFT بسیار پر کاربرد شود، شرکت اتریوم زبان برنامه نویسی Solidity را توسعه داده است که در ساخت نرم افزار ها با قرارداد های هوشمند در بستر اتریوم استفاده می شود. ',
        starnote:
            'مقیاس پذیری، برنامه پذیری، امنیت و غیر متمرکز بودن اتریوم آن رو به انتخاب اول توسعه دهنده ها تبدیل کرده است.',
        starnote2:
            'اتریوم هم اکنون یک پله پایین تر از بیت کوین، جایگاه دوم بازار جهانی رمز ارز ها را در اختیار دارد.',
      ),
    ],
  ),
  Nfts(
    id: 013,
    chapter: 'مقدمه',
    title: 'قرارداد هوشمند',
    image: 'images/0-smartContract.jpg',
    chapterDetailList: [
      ChapterDetail(
        resourceInfo: [
          {
            'name':
                'Blockchain Facts: What Is It, How It Works, and How It Can Be Used',
            'site': 'https://www.investopedia.com/terms/b/blockchain.asp',
          },
          {
            'name': 'What are smart contracts on blockchain?',
            'site': 'https://www.ibm.com/topics/smart-contracts'
          },
        ],
        id: 01301,
        image: 'images/0-smartContract.jpg',
        titleSection: 'قرارداد هوشمند',
        text:
            'قرارداد هوشمند یک کد است که می تواند در زنجیره بلوکی برای تسهیل، تأیید یا مذاکره برای یک توافق نامه ساخته شود. قراردادهای هوشمند تحت مجموعه شرایطی عمل می کنند که کاربران با آن موافقت می کنند. هنگامی که این شرایط برآورده شد، شرایط توافق به طور خودکار اجرا می شود.',
        text2:
            'این قرارداد ها  معمولاً برای خودکارسازی اجرای توافق استفاده می‌شوند تا همه شرکت‌کنندگان بتوانند فوراً بدون دخالت واسطه یا اتلاف زمانی از نتیجه مطمئن شوند. آنها همچنین می‌توانند گردش کار را خودکار کنند و در صورت برآورده شدن شرایط، اقدام بعدی را آغاز کنند. برای اینکه بتوانید قرار داد هوشمند بنویسید نیاز دارید تا زبان برنامه نویسی بلد باشید و کمی پول داشته باشید تا آن را قرارداد خودتون مستقر کنید.',
      ),
    ],
  ),
  Nfts(
    id: 014,
    chapter: 'مقدمه',
    title: 'کیف پول',
    image: 'images/0-wallet.jpg',
    chapterDetailList: [
      ChapterDetail(
        resourceInfo: [
          {
            'name': 'What Is a Blockchain Wallet? (investopedia.com)',
            'site':
                'https://www.investopedia.com/terms/b/blockchain-wallet.asp',
          },
          {
            'name': 'What Is a Blockchain Wallet? (fool.com)',
            'site':
                'https://www.fool.com/investing/stock-market/market-sectors/financials/blockchain-stocks/blockchain-wallet/',
          },
          {
            'name':
                'What Is A Blockchain Wallet & How Does It Work? (softwaretestinghelp.com)',
            'site':
                'https://www.softwaretestinghelp.com/what-is-a-blockchain-wallet/'
          },
        ],
        id: 01401,
        image: 'images/0-wallet.jpg',
        titleSection: 'کیف پول',
        text:
            'کیف پول دیجیتال یک برنامه بر پایه بلاکچین است که به شما  این امکان را می دهد تا ارز های دیجیتال و یا آیتم های بلاکچینی خودتون مثل NFT ذخیره کنید. توسط کیف پول شما میتوانید دارایی های خود را مدیریت کنید، کیف ها می توانند به صورت یک اپ داخل گوشی، تحت وب، برنامه دسکتاپ کامپیوتری و یا سخت افزاری باشند. کیف های سخت افزاری امن ترین گزینه هستند که توسط یک USB به کامپیوتر شما وصل می شوند.',
        text2:
            ' بعد از ثبت نام یک شناسه یکتا کیف پول به شما تعلق می گیرد و با لاگین کردن در برنامه یا سایت می توانید به اطلاعات حساب خود دسترسی پیدا کنید. در کیف پول می توانید دارایی ها، آخرین تراکنش ها و نمودار های قیمت ارزها را مشاهده کنید. کاربران می توانند با استفاده از کیف پول مانند کارت های بانکی معامله انجام دهند؛ با این تفاوت که بجای پول رمزارز مبادله می کنید.',
        starnote:
            ' بهتر است برای شروع سراغ کیف های سخت افزاری نروید و خیلی راحت به صورت آنلاین در یکی از ارائه دهندگان معتبر سرویس کیف پول دیجیتال ثبت نام کنید.',
        starnote2:
            ' در فصل های آینده چند کیف پول مناسب  برای NFT معرفی کرده ایم، البته کیف پول های متعدد و معروفی وجود دارد که شما می توانید با جستجو بیشتر در اینترنت با آنها آشنا شوید.',
      ),
    ],
  ),
  Nfts(
    id: 021,
    chapter: 'فصل اول',
    title: 'ان اف تی چیست',
    chapterDetailList: [
      ChapterDetail(
          id: 02101,
          titleSection: 'NFT چیست',
          text:
              'اگه تا حالا درباره NFT چیزی نشنیده اید بهتر است یک نگاهی به اتصال اینترنت خود بندازید؛ این احتمال وجود دارد که قطع شده باشد و از اخبار دنیا عقب مونده باشید! تو یک سال اخیر خبر های NFT تقریبا همه جا شنیده می شود. تیکتاک، توییتر، سی ان ان  و هر جایی که می رویم یک خبر از معاملات عجیب و نجومی NFT است، سوال اینجاست که NFT چیست؟ بدرد من میخورد؟ من هم می توانم پول در بیاورم؟',
          image2: 'images/chapter2.png',
          text2:
              'NFT یک دارایی شخصی است که کاملا در دنیای دیجیتال وجود دارد و نمی توانید لمسش کنید ولی می توانید مالکش باشید. NFT  می توان هر فایل دیجیتالی باشد مثلا یک کار هنری، مقاله، موزیک و حتی یک Meme که همین اواخر به قیمت 500 هزار دلار فروخته شد. سوالی که پیش می آید این است که این توکن ها چطور می توانند به هنرمندان کمک کنند و باعث خلاقیت آنها بشوند؟',
          starnote2:
              'NFT مخفف عبارت Non-Fungible Token به معنای "توکن غیرقابل معاوضه" می باشد.'),
      ChapterDetail(
        id: 02102,
        text:
            'در حالت کلی دارایی ها به دو دسته تقسیم می شوند: دارایی های قابل معاوضه  و دارایی های غیرقابل معاوضه. برای درک دارایی های قابل معاوضه بهترین مثال همین پول رایجی که همه ما هر روز استفاده می کنیم. وقتی شما 10.000 تومن از پول خود رو با 10.000 تومن از پول دوست صمیمی تان مقایسه کنید متوجه می شوید که از نظر شکل ظاهری و ارزش مادی هیچ فرقی باهم ندارند. پس اگر پول هایتان باهم جابه جا شود هیچ تغییری در ارزش دارایی تان ایجاد نشده است.',
        text2:
            'و اما دارایی های غیر قابل معاوضه؛ فرض کنید شما به یک خیاط سفارش دوخت یک دست لباس رو داده اید که کاملا منحصر به فرد برای شما دوخته شود. لباس شما یک دارایی غیر قابل معاوضه محسوب می شود چون هیچ لباسی شبیه به آن وجود ندارد.',
      ),
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'NFT art: what is it, how it works and what it means',
              'site': 'https://en.99designs.fr/blog/web-digital/nft-art/'
            },
            {
              'name': 'NFTs, explained',
              'site':
                  'https://crowdlustro.com/articles/nfts/9758303d-6162-4c16-9fe0-110c8ec46b75'
            }
          ],
          id: 02103,
          text:
              'قبل از اینکه سراغ هر چیز دیگه ای بریم اول می خواهیم شکل ساده شده ای از NFT رو توضیح بدهیم. فرض کنید شما یک نقاشی دیجیتالی رو با کلی زحمت خلق کردید. به این امید که با فروش این نقاشی پول خوبی رو به جیب بزنید. همون شب سیستم شما هک و یک نسخه از نقاشی شما در سیستم آقای هکر کپی شده! حالا چطور می توانید ثابت کنید که خالق آن اثر شما هستید؟ اینجاست که NFT به داد ما خواهد رسید! چطوری؟',
          text2:
              'اگر شما نقاشی دیجیتالی خودتون رو به NFT تبدیل کنید، حق مالکیت آن اثر تا زمانی که نقاشی رو فروخته نشود مال شماست و کسی نمی تواند ادعای مالکیت داشته باشد.',
          starnote2:
              'NFT میتونه کاور یک فیلم، یک قطعه موسیقی، یک گیف، یک ویدیو کوتاه و ... باشد',
          image2: 'images/1-artist.jpg'),
    ],
    image: 'images/chapter1.png',
  ),
  Nfts(
    id: 022,
    chapter: 'فصل یک',
    title: 'مزایا',
    image: 'assets/images/article-ch4-1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 02201,
        titleSection: 'مزایا NFT',
        text:
            'به وجود اومدن NFT باعث انقلاب در حوزه کاری هنرمندان، کلکسیونر ها و شرکت های بازی سازی و ارز دیجیتال شده است. یک هنرمند با خلق اثر های جدید که می توانند دیجیتالی باشند و هم به صورت فیزیکی روی بوم و... با تبدیل هنر خودش به NFT آن رو به همه و در بازار های بین المللی نشان بده و با حذف تمام واسطه ها برای نمایش در گالری های مختلف می تواند سود بیشتری نسبت به فروش آن ها داشته باشد.',
        starnote:
            'همچنین حق مالکیت، این امکان رو فراهم می کند که با هر خرید و فروش، قسمتی سود به خالق اثر هم  تعلق بگیرد.',
        image2: 'images/1-mazaya.jpeg',
        text2:
            'یک کلکسیونر می تواند با خرید NFT و نگه داشتن آن، منتظر بماند تا ارزشش بیشتر شود و با قیمت بالاتری بفروش برساند و سود خوبی نسیبش شود.',
      ),
      ChapterDetail(
        id: 02202,
        text:
            'حتما به این موضوع فکر کردید که چرا من باید پول به عکسی بدهم که خیلی راحت می شود حتی با یک اسکرین شات ساده یک نسخه از آن داشته باشم؟ انقلاب NFT اینجاست که مشخص می شود... NFT در خودش اطلاعات هویتی صاحب اثر را دارد و هیچ کس قادر نیست با نسخه کپی از آن خودش رو صاحب آن اثر خطاب کند. همچنین NFT اطلاعات هویتی خالق خودش رو هم دارد و خیلی راحت می شود متوجه شد که کدام نسخه اصلی است و کدام نسخه کپی برداری شده.',
        starnote:
            'به NFT علاوه بر یک کالای کلکسیونی می شود به دید یک کالای سرمایه ای هم نگاه کرد. این دیدگاه بستگی به نوع استفاده شما از این پدیده دارد.',
        text2:
            'یکی دیگه از جذابیت های NFT امکان دسترسی برای ارتباط با خالق آن اثر و خریدار است که به شما این امکان رو می دهد علاوه بر خرید، به یک کانال ارتباطی متصل شوید و با هنرمند مورد علاقه تان در ارتباط باشید.',
        starnote2:
            'این رو در نظر داشته باشید که NFT شما ممکن است به تعداد زیادی کپی شود اما نکته مهم این است که حق مالکیت آن هر جا که باشد به نام شما خواهد بود.',
      ),
      ChapterDetail(
        id: 02203,
        text: 'نکات مثبت NFT عبارت است از :',
        image: 'images/1-mazaya02.webp',
        benefits: [
          'حامل اطلاعات هویتی: هر توکن NFT یک مالک منحصر به فرد دارد که هرکسی می تواند آن را مشاهده و بررسی کند.',
          'غیر قابل تقسیم: هیچ دو NFT مشابهی وجود ندارند چون اصلا قابل تقسیم نیستن و هر توکن NFT منحصر به فرد است. از طرفی شما نمی توانید یک NFT رو به قسمت های کوچکتر تقسیم کنید و از آن ها استفاده کنید. به طور مثال شما می توانید یک 1000 تومنی رو به پول های خورد تقسیم بندی کنید اما NFT رو نمی شود تقسیم کرد.',
          'تایید پذیر: از آنجایی که NFTها بر بستر بلاکچین هستند، خیلی راحت امکان چک کردن اصل بودن NFT برای شما فراهم شده است. بنابراین دغدغه خرید کالای غیر اصل برای شما وجود ندارد.',
          'تخریب ناپذیر: فرض کنید سیل بیاد یا حتی آتش سوزی بزرگی در یکی از معروف ترین گالری های شهر رخ بدهد. چه بلایی سر NFT شما میاد؟ هیچی! NFT ده.',
          'دسترسی جهانی: هم خریداران NFT و هم خالق های آن ها به بازارهای جهانی دسترسی راحتی دارند و می توانند در سطح جهانی خرید و فروش خودشون رو انجام بدهند.',
        ],
      ),
    ],
  ),
  Nfts(
    id: 023,
    chapter: 'فصل یک',
    title: 'کسب درآمد',
    image: 'assets/images/article-ch4-1.jpg',
    chapterDetailList: [
      ChapterDetail(
          id: 02301,
          titleSection: 'خلق آثار هنری',
          text:
              'این مورد مخصوص هنرمندان است که می توانند یک اثر هنری مثل تابلو نقاشی، عکاسی، طرح گرافیکی و نواختن موسیقی رو خلق کنند. این افراد با پرداخت هزینه ای مشخص اثر خودشون رو به NFT تبدیل می کنند و شروع به قیمت گذاشتن روی مجموعه خودشون می کنند.',
          image: 'images/1-daramad01.jpg'),
      ChapterDetail(
          id: 02302,
          titleSection: 'حق امتیاز فروش',
          text:
              'تو این روش هنرمندهایی که اثر خودشون رو به شکل NFT فروختن می توانند حق امتیاز فروش روی اثر خودشون بذارند، که با هر بار خرید و فروش درصدی به کیف پولشون اضافه بشود. البته این روش می تواند باعث لطمه به مارکتینگ اون NFT وارد کند.',
          image: 'images/1-daramad02.jpg'),
      ChapterDetail(
        titleSection: 'بازی کردن',
        id: 02303,
        image: 'images/1-daramad04.jpg',
        text:
            'واگذاری  NFT:  شما می توانید توکن خودتون رو به افراد دیگه قرض بدهید تا وارد بازی بشوند و از این طریق کسب درآمد داشته باشید.',
        text2:
            'بازی کردن: بازی های بسیار زیادی هستند که با انجام مراحل مختلف به عنوان جایزه به شما NFT داده می شود!',
      ),
      ChapterDetail(
          id: 02304,
          titleSection: 'خرید و فروش ',
          text:
              'مانند تمامی بازار های دیگر شما می توانید بعد از بررسی و تحلیل های مورد نیاز توکن هایی که پتانسیل رشد قیمت دارند رو بخرید و بعد به قیمت بالا تری  بفروشید',
          image: 'images/1-daramad03.jpg'),
    ],
  ),
  Nfts(
    id: 024,
    chapter: 'فصل یک',
    title: 'مدیریت مالی',
    image: 'assets/images/article-ch4-1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 02401,
        image: 'images/1-hoshdar01.jpg',
        text:
            'یادتونه چه بلایی سر بورس اومد؟ خیلی ها وام های کلان گرفتند، خونه و ماشین زیر پاشون رو فروختن و پول رو داخل بورس سرمایه گذاری کردند. اما این دوستان چند نکته رو اصلا نمیدونستند و کسی هم بهشون نگفته بود...',
        text2:
            'اولین اصل سرمایه گذاری این است که شما باید با پول پس اندازی که دارید وارد سرمایه گذاری بشوید و نباید با پولی که نبود آن به زندگی شما و خانوادتان آسیب میزند دست به سرمایه گذاری بزنید. این رو همیشه یادتون باشه  سود زیاد همراه با ریسک خیلی زیاد است. پس اگر دنبال سود خیلی خوبی توی مدت زمان کمی هستید بدونید که ریسک آن سرمایه گذاری رو هم باید بپذیرید.',
      ),
      ChapterDetail(
        id: 02402,
        text:
            'هیچ تضمینی وجود ندارد که سرمایه گذاری شما سود داشته باشد. حالا میخواد در هر بازار و هر کاری باشد! اگر کسی به شما گفت من تضمین میدهم بابت این سرمایه گذاری، لطفا وسوسه نشوید. برای سرمایه گذاری در بازار های مختلف مثل بورس، ارز های دیجیتال، مارکت های NFT و ... به هیچ وجه وام نگیرید! در اصل وام برای زمانی بهترین بازدهی رو داره که شما بخواین برای توسعه کسب و کار فعلی خودتون که سود خوبی به شما میدهد، وام بگیرید و به کمک وام توسعه کسب و کار بدهید.',
        starnote:
            'ورود به هر بازاری دانش خاص خودش رو می خواهد. با حرف همسایه و دوست و آشنا نمی شود سرمایه گذاری کرد. پس اگر می خواهید سرمایه گذاری مطمئن داشته باشید حتما با متخصص آن بازار مشورت کنید',
        text2:
            'پس بهتره که در تب و تاب خرید و فروش های میلیون دلاری توکن های NFT بدون دانش کافی اقدام به سرمایه گذاری پر ریسک و خطرناک نکنید و برای سرمایه گذاری تو این حوزه خیلی احتیاط کنید.',
      ),
    ],
  ),
  Nfts(
    id: 031,
    chapter: 'فصل دوم',
    title: 'مینت کردن',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'How Much Does Minting an NFT Cost?',
              'site':
                  'https://pastel.network/how-much-does-minting-an-nft-cost/'
            },
          ],
          id: 03101,
          text:
              'در ابتدا باید بدونید که خرید یک NFT با مینت کردن یک NFT کاملا متفاوت است، در واقع با mint کردن شما یک چیز جدید در بلاکچین خلق می کنید. تبدیل کردن یک فایل دیجیتال  به یک دارایی دیجیتال در بلاکچین را Minting می گویند. یادتون باشه  NFT یک توکن است که حق مالکیت یک اثر را نشان می دهد. پس توکن های مینت شده ارزشمند هستند و با عکس ها و اسکرین شات هایی که از اینور و آنور گرفته اید فرق دارند. وقتی در خواست مینت یک آیتم را می دهید  باید مبلغی را به عنوان gas fee ( گس فی ) بپردازید که در بخش های بعدی در مورد گس فی توضیح بیشتری خواهیم داد. البته راه های مختلفی برای اینکه بتونید بدون پرداخت هزینه NFT بسازید هم وجود دارد که به آن ها هم خواهیم پرداخت.',
          image: 'images/2-minting.jpeg'),
    ],
    image: '',
  ),
  Nfts(
    id: 032,
    chapter: 'فصل دوم',
    title: 'گس فی',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'NFT Gas Fees Explained',
              'site':
                  'https://www.fool.com/investing/stock-market/market-sectors/financials/non-fungible-tokens/nft-gas-fees/'
            },
          ],
          id: 03201,
          text:
              'اگر بخواهیم خلاصه بگوییم گس فی پولی است که برای مینت یک NFT در شبکه بلاکچین اتریوم میپردازید، ولی این پول چیست و چرا باید پرداخت شود؟ در واقع این پولی است که به استخراج کنندگان بلاکچین برای پردازش تراکنش تعبیه شده در بلاکچین پرداخت می شود. همان طور که قبلا گفته شد بلاکچین یک شبکه غیر متمرکز است، یک دفتر کل دیجیتال که تمام تراکنش های گذشته در آن ثبت می شود، این دفتر کل بین تمام ماینرها (استخراج کننده ها) توزیع شده است، این  کامپیوتر های قدرمند وظیفه مدیریت شبکه و تایید تراکنش ها را بر عهده دارد مانند ساخت یک NFT تایید خرید یا فروش  آن. مانند تمام سیستم های محاسباتی، انرژی زیادی برای محاسبه این تراکنش ها استفاده می شود، برای کمک به بازپرداخت ماینرها برای کاری که انجام می دهند، هر زمان که معامله ای درخواست شود، هزینه گاز یا همان گس فی  دریافت می شود.',
          text2:
              'بخاطر اینکه اتریوم یک شبکه  بلاکچینی معروف است گس فی بالایی دریافت می کند،  برای فرار از این هزینه بالا دو راه وجود دارد یک این که از شبکه های بلاکچین با شهرت کمتر استفاده کنید تا هزینه کمتری بپردازید. در فصل معرفی مارکت ها، با بازارهایی که از شبکه های مختلف بلاکچین پشتیبانی می کنند آشنا می شوید. روش دوم استفاده از lazy minting است که در بخش بعدی آن را توضیح می دهیم.',
          image: 'images/2-gassfee.jpg'),
    ],
    image: '',
  ),
  Nfts(
    id: 033,
    chapter: 'فصل دوم',
    title: 'لزی مینت',
    chapterDetailList: [
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'What is lazy Minting',
              'site': 'https://www.lcx.com/what-is-lazy-minting/'
            }
          ],
          id: 03301,
          text:
              'برای اینکه بتوانید NFT خود را در بلاکچین ثبت کنید باید هزینه ای بپردازید، خیلی از هنرمندان از ترس اینکه NFT هایی که ساخته اند بفروش نرود و هزینه Minting که پرداخت کرده به هدر برود، آثار خود را به NFT تبدیل نمی کنند و از خیر NFT می گذرند.',
          text2:
              'برای جلوگیری از این اتفاق اولین بار پلتفرم OpenSea قابلیت LazyMinting را معرفی کرد، این قابلیت به شما اجازه می دهد تا آثار خود را در سایت لیست کرده و برای فروش بگذارید و زمانی که اثر بفروش می رسد هزینه Minting از خریدار گرفته می شود و در همان موقع اثر شما به عنوان NFT در زنجیره Mint می شود. هم اکنونه پلتفرم های دیگر هم چنین قابلیتی را به بازار خود افزوده اند.',
          starnote2:
              'بدون داشتن ابزار مناسب استفاده از قابلیت LazyMint کار دشواری است. البته برخی ابزار های اینترنت نسل 3 (Web3) این فرایند را تا حدی ساده تر می کنند.',
          image: 'images/2-lazyminting.jpg'),
    ],
    image: '',
  ),
  Nfts(
    id: 034,
    chapter: 'فصل دوم',
    title: 'ساخت ان اف تی',
    chapterDetailList: [
      ChapterDetail(
          id: 03401,
          titleSection: 'انتخاب آیتم',
          text:
              'اول باید آیتم خودتون رو آماده کنید، نقاشی، یک متن، یک قطعه موسیقی، ویدیو یا هر چیز دیگری که بتواند به عنوان یک فایل چند رسانه ای تولید شود. البته مطمئن شوید که حقوق مالکیت معنوی آن مورد را دارید. ',
          image: 'images/2-createNFT.jpg'),
      ChapterDetail(
        id: 03402,
        image2: 'images/mint.jpg',
        titleSection: 'انتخاب بلاکچین',
        text:
            'بعد انتخاب فایل نوبت به مینت کردن میرسه، که در بخش قبلی به آن پرداختیم، حالا وقتشه که مارکت مورد نظرتون رو انتخاب کنید و تصمیم بگیرید که دوست دارید آیتم خودتون رو در بستر کدام بلاک چین مینت کنید. شما باید تمام آپشن ها را در نظر بگیرید، مانند گس فی، میزان عرضه و تقاضا مارکت و ... ',
        starnote2:
            'در فصل معرفی مارکت ها با بازار های معتبر آشنا خواهید شد و گفته می شود هرکدام در بستر کدام بلاکچین فعالیت می کنند، علاوه بر این شما  می توانید با جستجو در اینترنت مارکت های بیشتری پیدا کنید.',
      ),
      ChapterDetail(
        id: 03403,
        titleSection: 'آماده کردن کیف پول',
        text:
            'اگه تا الان کیف پول نداشتین ، دیگه وقتشه یکی بسازین ، وقتی که یک بلاکچین را انتخاب کردید، به یک کیف پول دیجیتالی نیاز خواهید داشت که از آن بلاکچین پشتیبانی کند تا بتوانید NFT های خود را ذخیره کنید. ',
        text2:
            'برای ایجاد کیف پول، باید اپلیکیشن کیف پول را دانلود کنید. یک نام کاربری و رمز عبور ارائه دهید و کلیدهای خصوصی و عبارت بازیابی خود را به صورت آفلاین ذخیره کنید. کیف پول خودتان را حتمی خودتان بسازید و از کسی تقاضا نکنید این کار را برای شما انجام دهد. در نهایت رمز و عبارت پشتیبانی شما خیلی مهم است و نباید آن را در اختیار کسی قرار دهید. ',
      ),
      ChapterDetail(
        resourceInfo: [
          {
            'name': 'How to Make an NFT (fool.com)',
            'site':
                'https://www.fool.com/investing/stock-market/market-sectors/financials/non-fungible-tokens/how-to-make-an-nft/',
          },
          {
            'name':
                'How to create your own NFT in 5 simple steps - Domus (domusweb.it)',
            'site':
                'https://www.domusweb.it/en/news/2021/05/13/how-to-mint-your-own-nft-in-5-simple-steps.html',
          },
          {
            'name': 'How to Create an NFT (investopedia.com)',
            'site': 'https://www.investopedia.com/how-to-create-an-nft-6362495'
          },
        ],
        id: 03404,
        image: 'images/mint2.jpg',
        titleSection: 'آپلود و فروش',
        text:
            'بعد از انتخاب مارکت، ساخت و اتصال کیف پول خود به مارکت نوبت به آپلود فایل انتخابی میرسه. متناسب با مارکتی که انتخاب کردید مراحل آپلود رو  انجام دهید و در نهایت فایل خود را در لیست فروش قرار دهید. شما می توانید توکن خود را با یک قیمت ثابت بفروشید و یا اینکه آن را به حراج بگذارید تا افراد علاقه مند آن را با بالاترین قیمت خریداری کنند. البته برای حراج باید یک قیمت پایه در نظر بگیرید.',
      )
    ],
    image: '',
  ),
  Nfts(
    id: 041,
    chapter: 'فصل سوم',
    title: 'کیف پول مناسب ان اف تی',
    image: 'images/3-chapter3wallet.webp',
    chapterDetailList: [
      ChapterDetail(
          id: 04101,
          titleSection: 'متاماسک MetaMask ',
          text:
              'اگر به دنبال بهترین کیف پول اتریوم برای NFT هستید، متاماسک برای شماست. زیرا یکی از پرکاربردترین پلتفرم ها برای ارسال، دریافت و ذخیره سازی NFT است و می توانید بر روی موبایل و وب به این کیف دسترسی داشته باشید.',
          image: 'images/3-metaMask.jpg',
          text2: 'بلاکچین: Ethereum'),
      ChapterDetail(
        id: 04102,
        titleSection: 'تراست ولت Trust Wallet',
        text:
            'تراست ولت بهترین گزینه برای تازه واردان است. رابط کاربری آسان و دلپسند آن به شما این امکان را می دهد که به راحتی با آن ارتباط بر قرار کنید. در قسمت NFT کیف شما میتوانید به راحتی آیتم های خود را ببینید و مدیریت کنید. می توانید بر روی موبایل و وب به این کیف دسترسی داشته باشید.',
        image: 'images/3-Trust-Wallet.jpg',
        text2: 'بلاکچین: Ethereum ، Binance Smart Chain',
      ),
      ChapterDetail(
          id: 04103,
          titleSection: 'کیف پول بایننس Binance Chain Wallet',
          image: 'images/3-binanceWallet.jpg',
          text:
              'این کیف پول از سمت شرکت بزرگ بایننس پشتیبانی می شود و در نتیجه برای ذخیره سازی NFTهایی که در زنجیره بایننس ساخته شده اند مناسب می باشد. دسترسی به این کیف پول از راه وب امکان پذیر است.',
          text2: 'بلاکچین:  Binance Smart Chain، Binance Chain،Ethereum'),
      ChapterDetail(
        id: 04104,
        text:
            'یکی از کیف پول های معروف برای افرادی که در زمینه NFT فعالیت می کنند، از ویژگی های مهم آن بخش اختصاصی کالکشن NFT است ،کریپتو یک بازار اختصاصی NFT بر پایه بلاکچین خود دارد که همین باعث شده تا این کیف پول طرفداران زیادی داشته باشد',
        image: 'images/3-CryptoWallet.jpg',
        titleSection: 'Crypto.com DeFi Wallet',
        text2: 'پشتیبانی از بلاکچین Crypto.org Chain و Ethereum',
      )
    ],
  ),
  Nfts(
    id: 051,
    chapter: 'فصل چهارم',
    title: 'معرفی بازار های ان اف تی',
    chapterDetailList: [
      ChapterDetail(
        id: 05101,
        titleSection: 'Quint',
        text:
            'یک پلتفرم  رمزنگاری شده، که هدفش متصل کردن دنیای واقعی به متاورس است، یکی از کارهای جالبی که کوینت انجام میدهد  کالکشن های سفارشی خودش است، وقتی خریدارها از NFT های کوینت خرید میکنند فقط یک نسخه دیجیتال دریافت نمی کنند بلکه یک نسخه فیزیکی قاب شده هم، دم در خانه به آنها تحویل داده می شود. که متاسفانه در ایران استفاده از این قابلیت امکان پذیر نیست. ',
        starnote:
            'کسانی که اقدام به خرید توکن های کوینت میکنن مجوز دسترسی به کلوپ هنری متاورس به آنها داده می شود و همچنین می توانند به بخش ویژه بازار کوینت دسترسی داشته باشند.',
        benefits: [
          'این پلتفرم بخشی از اکو سیستم لاکچری کوینت است.',
          'تنوع بالایی از دسته های NFT',
          'تحویل دادن نسخه فیزیکی NFT',
          'دست یابی به کلوپ متاورس با خرید NFT',
        ],
        tableList: [
          'QUINT',
          'ندارد',
          '+۱۰۰۰',
          'مشخص نیست',
        ],
        image: 'assets/images/market_place/quint.jpg',
      ),
      ChapterDetail(
        id: 05102,
        titleSection: 'Crypto',
        text:
            'سایت crypto.com یکی دیگه از گزینه های مناسب برای خرید NFT  است. این سایت جز معروف ترین بازار های ارز دیجیتال  می باشد که بیشتر از ۱۰ میلیون نفر در آن فعالیت می کنند. در سال ۲۰۲۱ آنها بازار مخصوص NFT خودشان رو راه اندازی کردند که دسته های مختلفی  از موضوعات رو ارائه میکند. هدف این سایت آسان کردن تمام پروسه های سرمایه گذاری است، شما می توانید کمتر از یک دقیقه اکانت بسازید. توکن ها به صورت حراج یا با قیمت ثابت در دسترس هستند، این توکن با ارز دیجیتال ، اعتبار داخل سایت و یا دبیت کارت قابل خریداری هستند.',
        starnote:
            'یکی از مهم ترین ویژگی های این سایت نبود هزینه معامله است که آن رو از بقیه بازار ها متمایز کرده است. این اواخر هم بستر NFT های بر پایه اتریوم در این سایت فراهم شده و باعث شده که این بازار به سرعت گسترش پیدا کند.',
        benefits: [
          'نداشتن گس فی',
          'نداشتن هزینه معاملات',
          'فقط کارمزد ۱/۹۹% هنگام فروش NFT',
          'امکان خرید با کارت های اعتباری',
          'پشتیبانی از NFT بر پایه اتریوم',
        ],
        tableList: [
          'Crypto.org chain & Ethereum',
          'ندارد',
          '+۱۰۰۰۰۰',
          'بیشتر از ۵۰ هزار اتریوم در هفته',
        ],
        image: 'assets/images/market_place/crypto.jpg',
      ),
      ChapterDetail(
        id: 05103,
        titleSection: 'Binance',
        text:
            'قطعا با نام بایننس آشنا هستید، بزرگترین بازار ارز دیجیتال. یکی از ویژگی های بایننس پایین بودن هزینه معاملاتش است، فقط یک درصد! این بازار همچنین از NFT هایی بر پایه اتریوم و زنجیره هوشمند بایننس پشتیبانی میکند. در نتیجه گستره انتخاب وسیعی در اختیار معامله گر قرار میدهد. در حال حاضر در بایننس تنها راه خرید فروش از راه ارز دیجیتال است، برای مینت کردن توکن ها هم باید مقدار کمی BNB پرداخت کنید.',
        starnote:
            'یکی از جذابیت های این مارکت جعبه جادویی است که با خرید آن به صورت تصادفی یک NFT به شما میدهد، اگر شانس با شما یار باشد می توانید آیتمی بسیار ارزشمند بدست بیاورید.',
        benefits: [
          'هزینه معاملات کم',
          'جعبه های جادویی',
          'پشتیبانی از Binance smart chain و اتریوم',
          'امکان خرید ارز دیجیتال در خود بازار',
        ],
        tableList: [
          'Binance Smart Chain & Ethereum',
          'دارد',
          '+۱۰۰۰۰۰',
          'بیشتر از ۴۰ میلیون دلار در ماه',
        ],
        image: 'assets/images/market_place/binance.jpg',
      ),
      ChapterDetail(
        id: 05104,
        titleSection: 'Open Sea',
        text:
            'افراد زیادی معتقدن که اوپن سی (Open Sea) بهترین پلتفرم برای معامله NFT است. این بازار از نظر حجم معاملات حرف اول را در جهان می زند. اوپن سی بر پایه اتریوم است و انواع مختلفی از دسته بندی های NFT مثل هنر، نام دامنه، آیتم های داخل بازی و ....  رو ارائه می دهد. ',
        starnote:
            'مهمترین ویژگی این پلتفرم پشتیبانی کردن از ۱۵۰ نوع ارز دیجیتال و ۱۴ کیف پول مختلف است. هزینه معاملات ۲/۵ درصد فقط برای فروشنده ها لحاظ می شود.',
        benefits: [
          'تنوع بی نظیر NFT',
          'پذیرش بیشتر از ۱۵۰ نوع ارز دیجیتال',
          'پذیرش ۱۴ نوع کیف پول',
        ],
        tableList: [
          'Ethereum',
          'برای ثبت نام اکانت و هنگام پرداخت',
          '+۱۰۰۰۰۰۰',
          'بیشتر از ۵ میلیارد دلار در ماه',
        ],
        image: 'assets/images/market_place/opensea.jpg',
      ),
      ChapterDetail(
        id: 05105,
        titleSection: 'Nifty Gateway',
        text:
            'این پلتفرم دارای طیف گسترده ای از هنرمندان و خلاقان مشهور با گذشته ای معتبر است که کالکشن های این بازاربیشتر برای سرمایه گذاران سطح بالا طراحی شده است. این بازار جزئی از شرکت معتبر ارز های دیجیتال به نام Gemini است، در خارج از آمریکا تنها راه داد و ستد در این بازار ارز دیجیتال است که در حساب Gemini ذخیره شده. در هر معامله ۵ درصد هزینه برای فروشنده به علاوه  ۰/۳۰ دلار هزینه ثابت پرداخت می شود.',
        starnote:
            'یک بازار خاص برای NFT  های ویژه که در تعداد محدودی منتشر میشن.',
        benefits: [
          'توسط Gemini  پشتیبانی میشه',
          'تمرکز روی آیتم های خاص',
          'دارای کاربرهای معتبر و مشهور',
        ],
        tableList: [
          'Ethereum',
          'دارد',
          '+۶۰۰۰',
          'بیشتر از ۱۰۰ میلیون  دلار در ماه',
        ],
        image: 'assets/images/market_place/nifty-gateway.jpg',
      ),
      ChapterDetail(
        id: 05106,
        titleSection: 'Game stop',
        text:
            'یک بازار تازه تاسیس که توجه های زیادی را به خودش جلب کرده است. گیم استاپ روی آیتم های داخل بازی ها مثل تجهیزات دیجیتال، اسلحه، لباس و ...  تمرکز کرده است. مشخصات دقیق این پلتفرم هنوز کاملا واضح نیست ولی گفته می شود که این شرکت با غول های صنعت بازی در حال همکاری می باشد.',
        benefits: [
          'بر پایه پروتکل لایه دو اتریوم ساخته شده',
          'روی آیتم های بازی تمرکز داره',
          'با توسعه دهندگان صنعت بازی در ارتباط است',
          'برای توسعه دهندگان بازی سرمایه جمع آوری می کند',
        ],
        tableList: [
          'Immutable X',
          'مشخص نیست',
          'هنوز راه اندازی نشده	',
          'مشخص نیست',
        ],
        image: 'assets/images/market_place/game-stop.jpg',
      ),
      ChapterDetail(
        resourceInfo: [
          {
            'name':
                'Best NFT Marketplaces Reviewed - Where to Buy NFTs in 2022 (business2community.com)',
            'site': 'https://www.business2community.com/nft/best-marketplaces'
          },
        ],
        id: 05107,
        titleSection: 'Rarible',
        text:
            'یک بازار ایده آل برای  سرمایه گذارها، در این پلتفرم میتوانید به طیف وسیعی از انتخاب ها مثل آثار هنری دیجیتال، عکاسی، بازی، موزیک، دامنه ها و حتی به آیتم های متاورس دسترسی داشته باشید. در هر معامله ۲/۵ درصد هزینه معامله هم برای فروشنده و هم برای خریدار اعمال می شود.',
        starnote:
            'Rarible  علاوه بر بستر اتریوم ، NFT های بستر Flow وTezos  رو هم پشتیبانی می کند.',
        benefits: [
          'پشتیبانی از چند زنجیره',
          'پشتیبانی از کیف پول های متنوع',
          'پشتیبانی از کارت اعتباری و دبیت کارت در بیشتر از ۱۹۰ کشور',
        ],
        tableList: [
          'Ethereum, Flow, Tezos',
          'حدود ۰/۰۱۰ اتریوم هنگام خرید توکن',
          '+۴۰۰۰۰۰',
          'بیشتر از ۳۹۰ هزار  دلار در هفته',
        ],
        image: 'assets/images/market_place/rarible.jpg',
      ),
    ],
    image: 'assets/images/market_place/chapter4.jpg',
  ),
  Nfts(
    id: 061,
    chapter: 'فصل پنجم',
    title: 'ایردراپ',
    image: 'images/5-airdrop.jpg',
    chapterDetailList: [
      ChapterDetail(
          id: 06101,
          text:
              'ایردراپ (Air Drop)  معنی لغویش یعنی چیزی که از هواپیما رها میکنند و به زمین میفرستن، حالا این جعبه مرموز با چتر نجات چیست؟',
          starnote:
              'شاید در شروع کار یکی از راه های  مناسب برای ورود به دنیای NFT ،ایر دراپ ها باشند',
          text2:
              'توکنی که یک توسعه دهنده به صورت هدیه یا پاداش به شما بده یا اینکه بخاطر خرید و نگه داری یک آیتم به دارایی های شما اضافه کند ایردراپ گفته می شود، ایردراپ بیشتر جنبه تبلیغاتی داره و یک جور استراتژی جلب توجه جامعه مجازی است.',
          image: 'images/5-airdrop.jpg'),
      ChapterDetail(
          resourceInfo: [
            {
              'name': 'The Ultimate Guide to NFT Airdrops (nftplazas.com)',
              'site': 'https://nftplazas.com/guide-nft-airdrops/'
            },
            {
              'name':
                  'Airdrop Beginner Guide: What is an Airdrop and How is it Work? (one37pm.com)',
              'site':
                  'https://www.one37pm.com/nft/what-is-an-airdrop#:~:text=An%20airdrop%20is%20a%20distribution,to%20a%20brand%20or%20experience.'
            },
          ],
          id: 06102,
          text:
              'یکی از معمول ترین نوع های ایردراپ مدل استاندارد آن است که توسعه دهنده درصدی از توکن های پروژه را با اعضایی که نام نویسی کرده اند تقسیم می کند. ، بعد از ثبت نام در یک ایردراپ ممکن است  فعالیت هایی برای شما در نظر گرفته شود مانند اشتراک گذاشتن پست هایی در رسانه های اجتماعی و یا چیز هایی مشابه آن.',
          text2:
              ' بعد از انجام این فعالیت ها شما باید منتظر باشید شرکت، توکن هایش را با شما به اشتراک بگذارد، گاهی می توان توکن های با ارزشی در ایردراپ دریافت کرد اما به طور کلی نباید انتظار چیز چشم گیری را داشته باشید. ',
          starnote2:
              'ایردراپ های استاندارد هرگز از شما پولی نمی گیرند اگر با صفحه درخواست وجه روبرو شدید مطمئن باشید که یک کلاهبرداری است و سریع آنجا را ترک کنید . ')
    ],
  ),
  Nfts(
    id: 071,
    chapter: 'فصل شش',
    title: 'نکات خرید و فروش',
    image: 'images/6-tipsOfTrade.png',
    chapterDetailList: [
      ChapterDetail(
          id: 07101,
          titleSection: 'تخصص و شهرت تیم ',
          text:
              'بر خلاف گذشته این روزها خیلی از افراد بی نام و نشان و بدون هویت مشخص توانستند رشد کنند بدون آنکه کسی آنها را بشناسد، بطور مثال Board Ape Yacht Club یک کالکشن NFT بود که تا قبل از فاش شدن هویت سازندگان قیمت پایه هرکدام از توکن ها  به 300 هزار دلار می رسید در عین حال هیچ کس از هویت سازندگان آن اطلاعی نداشت. در نتیجه می توان گفت به جای تمرکز کردن روی هویت و تیم ها بهتر است روی شهرت و دست آورد هایشان تمرکز کنید، توسعه‌دهندگانی که ناشناس می‌مانند ممکن است به‌طور باورنکردنی حرفه‌ای و کار بلد باشند. کلاهبرداران را می توان حتی در تیم های عمومی پیدا کرد. ',
          starnote:
              'به جای تصمیم گیری فوری بر اساس این عوامل، تحقیقات گسترده ای را برای تعیین اینکه آیا تیم ارزش  دارد یا خیر انجام دهید.',
          text2:
              'نکته دیگری که باید در مورد آن فکر کنید این است که آیا آنها هرگونه مشارکت یا همکاری را با شرکت های بزرگ اعلام کرده اند یا نه. ممکن است آنها در حال  همکاری با کسب و کارها و یا مشارکت با توسعه دهندگان شناخته شده و با سابقه باشند.'),
      ChapterDetail(
        id: 07102,
        titleSection: 'نفوذ در جامعه',
        text:
            'اگر بپرسید چرا BAYC اینقدر معروف است ، مطمئنا پاسخ  محبوبیت در جامعه است . مردم لوگو های BAYC را دوست دارند و با افتخار عکس میمون هاشون رو روی عکس های پروفایلشان می گذارند.',
        image2: 'images/6-2-image.png',
        starnote2:
            'هنگام انتخاب پروژه ای برای سرمایه گذاری، به دنبال جامعه ای باشید که تمام تلاش خود را می کند تا مجموعه را به خوبی معرفی کند و مهمتر از آن، آن را به جلو هدایت کرده و از آن حمایت کند.',
        text2:
            'البته باید دقت کنید که بیشتر جوامع NFT در دیسکورد هستند و تعداد زیادی از پروژه ها از ربات استفاده می کنند تا جوامع خودشون رو پویا نشون بدن، اگر آنها را با دقت بررسی کنید، ربات ها به راحتی قابل تشخیص هستند.',
      ),
      ChapterDetail(
        id: 07103,
        titleSection: 'نقشه راه ',
        text:
            'پروژه های خوب دارای برنامه ریزی های سنجیده شده ای هستند. البته همیشه اینگونه نیست و نمیشه گفت تمام پروژه های عالی با یک برنامه ریزی دقیق شروع شدند، ',
        text2:
            'ولی باید همیشه به نقشه های راه دقت کنید که آیا انجام تمام ادعا هایی که در یک مدت زمان مشخص وعده داده اند شدنی است یا نه، اگر با یک نقشه راهی مواجه شدید که در مدت زمان خیلی کوتاه ، ادعا های خیلی عظیمی داشت ، بهتر است در تصمیمتان برای سرمایه گذاری تجدید نظر کنید.',
      ),
      ChapterDetail(
        id: 07104,
        text:
            'اتریوم در اکثریت قریب به اتفاق در  بسیاری از کالکشن های موفق NFT  استفاده شده است . حجم معاملات در بستر اتریوم نسبت به رقبا بسیار بالاتر است. سولانا یا پروژه های دیگر مثل Binance Smart Chain  ( زنجیره های هوشمند بایننس)  در تلاشند تا دنباله رو اتریوم باشند  ولی شهرت و حجم معاملات کمتری نسبت به اتریوم دارند.',
        titleSection: 'بر اساس کدام زنجیره هستند ؟',
      ),
      ChapterDetail(
        id: 07105,
        titleSection: 'حجم و قیمت',
        text:
            'وقتی وارد بازار می شوید توکن هایی که به اصطلاح به آنها bluechip (ژتون آبی ) می گویند نسبت به بقیه آیتم ها در بازار قیمت و حجم معاملات بالاتری دارند',
        starnote:
            'بلو چیپ به NFT های  شناخته شده، تثبیت شده و پایدار گفته می شود، که به عنوان یک سرمایه گذاری بلند مدت خوب در نظر گرفته می شوند.',
        text2:
            'به یاد داشته باشید که  NFT مانند ارز های دیجیتال نیست که با فشردن کلیک فروش بتوانید آن را بفروشید ، در بازار NFT شما باید توکن خود را برای فروش بگذارید و برایش یک خریدار پیدا کنید، به همین دلیل خیلی مهم است که کالکشن هایی رو انتخاب کنید که حجم معاملات بالایی دارند . اگر وارد یک کالکشن شوید که حجم معاملاتش به تدریج رو به کاهش است این خطر شما رو تهدید می کند دیگر نتوانید آن را بفروشید.',
      ),
      ChapterDetail(
        id: 07106,
        titleSection: 'چرخش  قیمت ',
        text:
            'سرمایه گذاری در NFT یک بازی کاملا جدیده که ناگفته های بسیاری دارد، وقتی یک توکن را به قیمت پایین تر میخرید و بعد آن را با قیمت بالاتر میفروشید به اصطلاح به آن چرخش قیمت یا flipping میگویند ولی این نصیحت ما را جدی بگیرید ، این کار نیاز به تحقیقات گسترده و غوطه ور شدن در بازار NFT است ',
        starnote:
            'این جمله از مانترا " شایعه را بخر و خبر را بفروش " در اینجا کاربرد دارد. ',
        starnote2:
            'صادقانه بگوییم که این کار بسیار سختی است و به تلاش و تجربه بالایی نیاز دارد.',
      ),
      ChapterDetail(
          id: 07107,
          text:
              'با استفاده از جستجوی عکس گوکل می توانید اطلاعات مهمی راجب به عکس پیدا کنید و ببینید که چقدر تنوع یا توکن های مشابه نمونه مورد خرید شما وجود دارد و یا چه مدت است که این تصویر در اینترنت وجود دارد.',
          titleSection: 'جستجوی معکوس در گوگل ',
          image: 'images/6-7-Reverse-Image-Search.png',
          resourceInfo: [
            {
              'name':
                  'NFT Tips: 15 Pro Tips for Beginners + How to Invest in NFTs (justcreative.com)',
              'site': 'https://justcreative.com/nft-tips-how-to-invest-in-nfts/'
            },
            {
              'name':
                  'Investing in NFTs: 12 Must-Read Tips to Spot the Best Projects (cryptopotato.com)',
              'site': 'https://cryptopotato.com/nft-investmnet-tips/'
            },
            {
              'name':
                  '9 Tips for buying and trading NFTs like a Pro (swappable.io)',
              'site':
                  'https://swappable.io/blog/safety-tips-for-buying-selling-nfts-2/'
            },
          ])
    ],
  ),
  Nfts(
    id: 081,
    chapter: 'فصل هفتم',
    title: 'مقدمه',
    image: 'images/7-Scams1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 08101,
        titleSection: 'کلاهبرداری های معمول در NFT',
        image: 'images/7-Scams1.jpg',
        text:
            'از زمانی که محبوبیت NFT بین مردم زیاد شد،کلاهبردارن هم به این تکنولوژی علاقه مند شدند، این روز ها باید مراقب NFT های تقلبی ، راگ پول ، پامپ اند دامپ و خیلی  مشکلات دیگر در این صنعت باشیم، در این بخش با ما همراه باشید تا با انواع کلاهبرداری های رایج در این حوزه آشنا شوید',
        starnote:
            'صنعت NFT در سال 2020  پایش را روی پدال گاز گذاشت و بیشتر از %300 از سال قبل خود رشد کرد ولی بعد از چند هفته ابتدایی ماه می سال 2022 فروش این توکن ها 92 درصد نسبت به سال قبل خود کمتر شد و همین طور شمار کیف های فعال معاملاتی از 119000 به 14000 کاهش پیدا کرد.',
        text2:
            'با این وجود این بازار هنوز هزاران میلیارد دلار سرمایه در گردش دارد که بستر بسیار خوبی برای کلاهبرداران است، این موضوع نگرانی های امنیتی زیادی را با خود به همراه دارد، در دنیای واقعی دزد برای اینکه بتواند اثر هنری را بدزدد باید از سد دیوارها، حفاظ ها و دوربین های موزه بگذرد ولی امروزه  می توان با استفاده از مالورها و یا تکنیک های مهندسی شده اجتماعی به کیف های پول دیجیتال نفوذ کرد.',
      ),
      ChapterDetail(
        id: 08102,
        text:
            'وقتی هنرمند زمینه دیجیتال "قین ها " (Qin ha) در سال 2020 درگذشت کلاهبرداران از این فرصت استفاده کردند و آثار هنری او را از جانب او به صورت NFT فروختند،  در سپتامبر 2022 وب سایت نقاش خیابانی آقای "بنکسی" (Banksy) هک شد و یکی از آثارش که قرار بود به عنوان اولین NFT او باشد به قیمت 336 هزار دلار فروخته شد.',
        image2: 'images/7-intro-banksy.jpg',
        text2:
            'فقدان قوانین و مقررات در بازار NFT فرصت های مناسبی برای انواع کلاهبرداران ایجاد کرده است، از این رو کمپانی های بزرگ مانند Adobe  در تلاشند تا با خلق مهرهای احراز هویت، به این توکن ها مشروعیت ببخشند،با تمام این تمهیدات ضد کلاهبرداری ، این بازار به سرعت در حال گسترش و بزرگ شدن است که به شدت به رفتار کاربران وابسته است ، در ادامه چند کلاهبرداری معمول را با هم بررسی می کنیم.',
      ),
    ],
  ),
  Nfts(
    id: 082,
    chapter: 'فصل هفتم',
    title: 'روش های کلاهبرداری ',
    image: 'images/7-Scams1.jpg',
    chapterDetailList: [
      ChapterDetail(
        id: 08201,
        titleSection: '	پیام های شخصی در دیسکورت ',
        image: 'images/7-discord.jpg',
        text:
            'به طور کلی دیسکورت جذابیت خاصی برای مجرمان سایبری دارد و راه های مختلفی برای کلاهبرداری می توان در آن یافت، دیسکورت به جوامعی تقسیم شده که به آن سرور می گویند، در سرورها افراد می توانند با هم صحبت کنند، بازی کنند و بازی هایشان را به نمایش بگذارند.',
        starnote:
            'در دسامبر 2021 یک سرور دیسکورت مربوط به یک بازی NFT که به تازگی راه اندازی شده بود، 373 نفر متوجه شدن که احراز هویت کیف پولشان با خطر مواجه شده ، در این حمله سایبری 150 هزار دلار سولانا به سرقت رفت.',
        text2:
            'یک راه دیگر دزدی از راه پیام شخصی است، در این شرایط فرد کلاهبردار سعی می کند خود را به عنوان یک هنرمند، اینفلوئنسر یا یک برند بزرگ جا بزند و مخاطب را فریب دهد، شما هرچقدر در جامعه های بزرگتری از دیسکورت باشید پیام های کلاهبرداری بیشتری دریافت خواهید کرد ، در نهایت باید مراقب باشید به هیچ پیامی از غریبه ها و یا مبتنی بر خرید و فروش و دریافت پول در دیسکورت جواب ندهید، قبل از خرید هر توکن از اعتبار و مشروعیت آن اطمینان حاصل کنید.',
      ),
      ChapterDetail(
          id: 08202,
          image: 'images/7-fakeaccount.jpg',
          titleSection: 'پروفایل های جعلی در رسانه های اجتماعی ',
          text:
              'کاربران شبکه های اجتماعی، حالا چه در توییتر، اینستاگرام یا هرجای دیگری باید مراقب اکانت های جعلی باشند، بیشتر این  پروفایل ها کپی ورژن اصلی می باشند، اگر کمی مراقب باشید و به جزئیات دقت کنید می توانید آنها را تشخیص دهید ،',
          starnote:
              ' گاهی فقط یک حرف پس و پیش بودن در اسم پروفایل می تواند زنگ خطری باشد برای شناسایی این گونه اکانت ها ',
          text2:
              'علاوه بر این ، ربات هایی هستند که در غالب کاربر های شبکه های اجتماعی با شما ارتباط برقرار می کنند و با اطلاعاتی که از شما درخواست میکنند می توانند به کیف پول  شما دسترسی پیدا کنند، اگرچه آنها بازیگران بدی هستند و کم موفق به فریب افراد می شوند ولی همان تعداد اندکی که فریب می خورند پول خوبی نصیب کلاهبرداران می کنند. یکی دیگر از روش های معمول این است که فرد کلاهبردار به قربانی پیام می دهد و به گونه ای رفتار میکند که گویی در زمینه ارزهای دیجیتال و یا مسائل وابسته به آن نیاز به کمک دارد.',
          starnote2:
              'قبل از ارتباط با هر فرد ، تعداد فالورها ، تعداد Tweet ها ، retweet ها و یا اینکه اکانت دارای محتوای اصلی است را چک کنید.'),
      ChapterDetail(
          id: 08203,
          titleSection: 'فیشینگ',
          text:
              'یکی دیگر از تاکتیک های پرکاربرد کلاهبرداری کپی کردن وب سایت های معتبر است، کلاهبردارن سایت هایی دقیقاً مشابه با سایت های اصلی طراحی می کنند، در توییتر و دیسکورت پر است از لینک  کیف پول و NFT  جعلی که سطح شباهت آنها به لینک کمپانی واقعی حیرت آور است و فقط با چشمان تیز بین و دقت بالا می توان تفاوت آنها را تشخیص داد.',
          text2:
              ' برای همین خیلی مهم است که همیشه قبل از کلیک کردن بر روی لینک حتمی آن را چک کنید، به ویژه وقتی که سایت از ما اطلاعات شخصی بخواهد. ',
          starnote2:
              'هرگز این قانون طلایی را فراموش نکنیدکه هیچ وقت رمز کیف پول و یا کد فراموشی خود را هیچ جا خارج از کیف پول خودتان استفاده نکنید.'),
      ChapterDetail(
        id: 08204,
        titleSection: 'جعل هویت هنرمندان ',
        text:
            'همانند بنکسی هنرمندان دیگری هم درگیر چنین شرایطی شدند، به طور مثال Tyler Hobbs طراح پروژه Fidenza از پلتفرم Sol Blocks بخاطر سو استفاده از کد های او و فروش جعلی آثارش شکایت کرد، همینطور آثار هنری درک هافمن با یک اکانت جعلی که حتی تیک آبی هم داشت فروخته شد. اینگونه کلاهبرداری ها اینقدر زیاد است که می توان از آن یک لیست بالا بلند ساخت.',
      ),
      ChapterDetail(
        id: 08205,
        titleSection: 'پامپ اند دامپ ',
        text:
            'در پامپ اند دامپ (Pump and Dump ) یا همان بالا بردن و خالی کردن ، یک شخص یا گروهی تعداد زیادی NFT خریداری می کنند و بعد آن را به صورت مداوم به خودشان می فروشند ، با این خرید و فروش های جعلی که همه خریداران و فروشنده ها افراد یکسانی هستند این توکن ها مورد توجه قرار می گیرند و خریداران واقعی فکر می کنند با یک توکن پرطرفدار روبرو هستند و آن را با قیمت بالایی می خرند اما بعد گروه یا شخص کلاهبردار دیگر اقدام به خرید آن آیتم نمی کنند و پشت آن را خالی می کنند در نتیجه قیمت توکن به شدت افت می کند.',
        image2: 'images/7-pump-dump.jpg',
        starnote:
            'رابرت ایوان : خیلی از این فروش های عظیم NFT افرادی هستند که دارند به خودشان می فروشند، چنین تحرکاتی یا نشان دهنده پول شویی است یا پامپ اند دامپ',
        text2:
            'در یکی از کلاهبرداری ها به این سبک فردی 500 میلیون دلار کریپتو پانکی را به عنوان طعمه قرار داد ، کسی که خرید را انجام داد به سرعت پول ها را دوباره به کیف پول خودش انتقال داد، در واقع این فقط یه حرکت نمایشی برای جلب توجه خریداران بود',
      ),
      ChapterDetail(
        id: 08206,
        titleSection: 'راگ پول ',
        text:
            'راگ پول (Rug pull) یک روش کلاهبرداری معمول دیگر مثل پامپ اند دامپ می باشد، در این روش کلاه بردار یک پروژه را تبلیغ می کند و سر زبان ها می اندازد و در خواست سرمایه گذاری میکند و در نهایت بدون هیچ مسئولیتی پروژه را رها می کند ،',
        starnote:
            'راگ پول را اگر بخواهیم لغوی ترجمه کنیم به معنی کشیدن قالی از زیر پا می شود که کاملا مفهوم را می رساند.',
        text2:
            ' توسعه دهنده ها زمانی پروژه را رها می کنند که مطمئن شوند سرمایه گذاران را به صورت کامل تخلیه کردند و سپس پروفایلشان را از بازار ها و شبکه های اجتماعی پاک می کنند. یکی از معروف ترین نمونه این نوع کلاهبرداری مربوط می شود به ارز دیجیتال "Squid game" که از سریال شناخته شده بازی ماهی مرکب الهام گرفته بود.ارزش این ارز در دو هفته به 2800 دلار رسید ولی ناگهان همه چی  از بین رفت، تمام اکانت های شبکه اجتماعی و وب سایت هایش بدون هیچ اثری نا پدید شد، در این کلاهبرداری 3.3 میلیون دلار به سرقت رفت .',
      ),
      ChapterDetail(
        id: 08207,
        titleSection: 'کلاهبرداری مناقصه ها ',
        text:
            'در حراج فروشنده سعی دارد یک NFT واقعی را  به فروش برساند و نوع ارز دیجیتال را برای پرداخت نیز مشخص می کند ولی فرد کلاهبردار می تواند ارز پیشنهادی خود را به واحدی با ارزش کمتر تغییر دهد',
        text2:
            'یک راه دیگر پاک کردن و اضافه کردن NFT از بیست بازار است. در این حین کلاهبردار  قیمت را یک رقم اعشار به سمت راست می برد، تغییری که ممکن است خریدار متوجه آن نشود و هزینه ای خیلی بیشتر از مبلغی که ابتدا دیده بود بپردازد.',
      ),
      ChapterDetail(
          id: 08208,
          titleSection: 'دزدی اکانت شبکه اجتماعی ',
          text:
              'در این روش کلاهبرداران اکانت های معروف را هک کرده و اقدام به انتشار هدایا و پیشنهادات جعلی  در آن اکانت میکنند، کاربران با توجه به اعتمادی که به آن اکانت ها دارند وارد لینک های جایزه می شوند، بلافاصله از آنها در خواست رمز و اطلاعات شخصی می شود، و در نهایت بدون اینکه جایزه ای دریافت کنند تمام اطلاعات خود را دست کلاهبرداران می سپارند.',
          image2: 'images/7-socialhijack.png',
          text2:
              'ترجمه عکس : اکانت دیسکورت ما در معرض خطر است ، روی هیچ لینکی کلیک نکنید و مینت انجام ندهید.تهدیدات پاک شده اند ، با این وضع ما پیوسته سرور را تحت نظر می گیریم تا همه چیز کاملا امن شود، لطفا هر اعلامیه جدیدی از ما دیدید چند بار درستی آن را بررسی کنید.'),
      ChapterDetail(
          id: 08209,
          titleSection: 'مینت جعلی',
          image: 'images/7-sleepNFT-Minting.jpg',
          text:
              'Sleepminting ( مینت جعلی)  یکی از پیچیده ترین روش های کلاهبرداری است که شناسایی آن به این راحتی ها هم نیست ،در این روش شخص کلاه بردار بجای اینکه NFT هارا در کیف پول خودش ضرب کند (مینت کند) آنها را در کیف پول هنرمند یا شخصی مشهور مینت میکند، با اینکار به نظر میرسد که آن شخص مشهور خودش این توکن ها را ضرب  کرده ',
          text2:
              'سپس کلاهبردار مالکیت آن NFT هارا به نام خودش تغییر می دهد بدون آنکه آن هنرمند روحش هم خبردار شود. این فرایند توسط یک قرارداد سفارشی شده توسط کلاه بردار انجام می شود که به او این اجازه را می دهد که  آزادانه توکن ها را بین کیف های پول انتقال دهد. از آنجایی که کیف های پول افراد مشهور همیشه زیر ذره بین است در نتیجه توجه همگان به این NFT ها جلب می شود.',
          starnote2:
              'یکی از راه هایی شناسایی این گونه تقلب ها بررسی جزئیات توکن است ، با مطالعه قسمت سوابق انتقال توکن و اینکه آیا توکن  با همان آدرس کیف پول هنرمند مینت شده است یا نه شاید بتوانید سر نخ هایی پیدا کنید.'),
      ChapterDetail(
        id: 08210,
        titleSection: 'سو استفاده از اعتماد',
        text:
            'یکی از روش های کلاهبرداری متداول در کشور ما سو استفاده از اعتماد است، وقتی فردی اطلاعات کافی برای ورود به بلاکچین ندارد از افراد متفرقه در خواست می کند تا برای او کیف پول بسازند در این فرایند شخص کلاه بردار به گونه ای رفتار می کند که رمز شما رو ندیده است و اجازه می دهد شما رمز خودتان را انتخاب کرده و وارد کنید اما نکته اینجاست که او کد بازیابی شما را برای خود ذخیره می کند و بدون نیاز به داشتن رمز شما می تواند به کیف پول شما وارد شده و تمام دارایی شما را به سرقت ببرد ',
        starnote: 'شما هیچ مدرکی ندارید که بتوانید آن شخص را متهم کنید.  ',
        text2:
            'پیشگیری از این گونه کلاهبرداری بسیار ساده است ، اطلاعات خود را بالا ببرید و خودتان حساب های شخصی خودتان را بسازید و اطلاعات خود را در جای مطمئن نگه داری کنید',
      ),
    ],
  ),
  Nfts(
      id: 083,
      chapterDetailList: [
        ChapterDetail(
            id: 08301,
            text:
                'هیچ کس نمی خواهد یک ایده بالقوه انقلابی را از دست بدهد.مطمئناً همه دوست دارند از فرصت های جدید برای سرمایه گذاری استفاده کنند، خبر خوب این است که ثروت های زیادی در دنیای کریپتو نهفته است ولی کلاه برداران هم از این موضوع با خبر هستند و از ترفند های زیادی استفاده می کنند تا از پول شما سود ببرند. ',
            text2:
                'خوشبختانه اگر حواستان جمع باشد می توانید از این کلاهبرداری ها دوری کنید، همیشه هوشیار باشید، تا اطلاعات کامل بدست نیاورده اید خرید نکنید ، مطئن باشید که به اندازه کافی راجع به پروژه مورد نظر تحقیق کرده باشید و در نهایت مهم تر از همه از اطلاعات شخصی و رمز هایتان به خوبی محافظت کنید.',
            image: 'images/7-finalnote.jpg',
            resourceInfo: [
              {
                'name':
                    'Sleepminting: How to Avoid the End of NFTs » Learning Cryptos',
                'site':
                    'https://www.learningcryptos.com/sleepminting-how-to-avoid-the-end-of-nfts/'
              },
              {
                'name': 'NFT scams: 10 types + how to avoid NFT fraud | Norton',
                'site':
                    'https://us.norton.com/internetsecurity-online-scams-nft-scams.html'
              },
              {
                'name': '7 Most Common NFT Scams (beincrypto.com)',
                'site': 'https://beincrypto.com/learn/nft-scams/'
              },
              {
                'name':
                    '7 NFT scams: How to spot them and keep your assets safe | finder.com',
                'site': 'https://www.finder.com/nft-scams'
              },
              {
                'name':
                    'Common NFT scams and how to avoid them | WeLiveSecurity',
                'site':
                    'https://www.welivesecurity.com/2022/05/23/common-nft-scams-how-avoid-them/#:~:text=Fake%20bids%20in%20NFT%20auctions,one%20with%20a%20lower%20value.'
              },
              {
                'name':
                    'How To Spot A ‘Fake’ NFT Mint. Just follow whale activites, and you’ll… | by The Prometheus Project | Medium',
                'site':
                    'https://medium.com/@ThePrometheusProject/how-to-spot-a-fake-nft-mint-5615f6417be0#id_token=eyJhbGciOiJSUzI1NiIsImtpZCI6IjQwMmYzMDViNzA1ODEzMjlmZjI4OWI1YjNhNjcyODM4MDZlY2E4OTMiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2FjY291bnRzLmdvb2dsZS5jb20iLCJuYmYiOjE2NjE0MzEyNjYsImF1ZCI6IjIxNjI5NjAzNTgzNC1rMWs2cWUwNjBzMnRwMmEyamFtNGxqZGNtczAwc3R0Zy5hcHBzLmdvb2dsZXVzZXJjb250ZW50LmNvbSIsInN1YiI6IjExMDY3NzI1MjY3MDkwMzA4NDYyMSIsImVtYWlsIjoic2luYS56cnBAZ21haWwuY29tIiwiZW1haWxfdmVyaWZpZWQiOnRydWUsImF6cCI6IjIxNjI5NjAzNTgzNC1rMWs2cWUwNjBzMnRwMmEyamFtNGxqZGNtczAwc3R0Zy5hcHBzLmdvb2dsZXVzZXJjb250ZW50LmNvbSIsIm5hbWUiOiJzaW5hIHpwIiwicGljdHVyZSI6Imh0dHBzOi8vbGgzLmdvb2dsZXVzZXJjb250ZW50LmNvbS9hLS9BRmRadWNxd3F1R0Yya0tFTDJBQzhDbmZ5QU1BRFVVRjF0bmhhR3RfVGpoSktBPXM5Ni1jIiwiZ2l2ZW5fbmFtZSI6InNpbmEiLCJmYW1pbHlfbmFtZSI6InpwIiwiaWF0IjoxNjYxNDMxNTY2LCJleHAiOjE2NjE0MzUxNjYsImp0aSI6ImMzZGM5NTEyMTQ5N2JhOTczNWIxZjAyNzBlNTM3MWRiNDU5MmRhNzEifQ.iM5YOCbX_UqVM1GnJG39kkDfMAGPsU21ILvrX8uJMOV9gMgEuKrPWdgwZlMImiX0cLYQx7LScug6y32EA-2crshGtAHdDbo2HsZFk8jw7E4D2wrCqiaqypWILUgz29cRzb_ooZF76x7QVF3K2Hs-DOcNpt7pHPKxKilR-ZeaxqXzsDEucPFDEebfb5qCiUHhE6svT1TsGkZE_vy6z39N470DlkaiOPjfvdtGB0wWpI32HKAWpgmXKUG6WjLcbi-Pv0Or8r5ieR8o3FpXpaQ-O2GcmzZInGOF8ZGbpiRKkPBaQAlWJdhX9hcx49M2ta8mKfVRlxvDOc2m6YngY8Fuyw'
              },
              //{'name': '', 'site': ''},
            ])
      ],
      chapter: 'فصل هفتم',
      title: 'روش های کلاهبرداری ',
      image: 'images/7-finalnote.jpg')
];
